{
  "backend/main.mo": "Defines user-related types such as moods, genders, relationship intents, avatars, and profiles, including text conversion helpers. Partial actor logic and additional fields are present but truncated.",
  "feature_evidence.json": "Contains structured feature evidence entries mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for many frontend files, describing their purpose and recent changes.",
  "frontend/index.css": "Tailwind CSS base file defining theme variables for light and dark modes and applying global styles.",
  "frontend/index.html": "Root HTML document providing the mounting point and module script for the frontend SPA.",
  "frontend/src/App.tsx": "Sets up global providers and TanStack Router routes, including public and authenticated sections with the new /closest-connections route.",
  "frontend/src/components/app/AppFooter.tsx": "Empty placeholder file for a potential app footer component.",
  "frontend/src/components/app/AppHeader.tsx": "Header component with app title, attribution, theme toggle, journal button, and user menu including logout and profile navigation.",
  "frontend/src/components/app/AppLayout.tsx": "App layout wrapper that renders header, bottom nav, journal overlay, and routed content with support for children override.",
  "frontend/src/components/app/BottomNav.tsx": "Renders a fixed bottom navigation bar with icons, highlighting the active route and showing unread notification badges.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Displays a floating action button for composing a new journal entry when visible.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Provides a button to switch between light and dark themes using next-themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Blocks children behind loading and login screens until Internet Identity authentication completes.",
  "frontend/src/components/auth/LoginPanel.tsx": "Shows the login UI with branding, randomized text, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays a generated summary of circle energy inside a styled card.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Lists circle members with profile details, pulse scores, and controls for removing members.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form allowing users to enter a share code to request joining a circle.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Shows pending join requests with profile info and buttons to accept or decline.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Lets users manage up to two Safe People with recommendations, profile info, and toggling logic.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Displays and edits a user's share code with copy, edit, and save actions tied to profile data.",
  "frontend/src/components/common/IconActionButton.tsx": "A button wrapped with a tooltip that supports icons and labels.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible UI component showing hidden content under a trigger button.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Shows a daily mood check‑in reminder with dismiss and navigate-to-check-in actions.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Renders a silent signal entry showing mood, author info, and timestamp with styling.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Lets users send predefined silent signals to safe people and handles validation and status.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Popover calendar selector for choosing a journal date, preventing future dates.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Manages viewing, creating, and deleting journal entries for a selected date with edit restrictions.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Full-screen journal sheet with rules, date picker, and entries panel, optionally resetting to today.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Displays micro‑action suggestions based on mood history, falling back to an info prompt when insufficient data.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood history over a selectable timeframe and shows trends, distributions, concerns, and micro‑actions.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Allows users to select or upload an avatar with validation, preview handling, and parent notification.",
  "frontend/src/components/profile/ProfileGate.tsx": "Guards profile‑dependent content by loading the user's profile, handling errors, and triggering setup when needed.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides new users through multi‑step profile creation and saves the completed profile.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Plays sound effects when new notifications, feed items, join requests, or circle members appear after initial load.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "UI component for selecting predefined or custom context tags with validation and soft limits.",
  "frontend/src/components/status/MoodPicker.tsx": "Searchable mood selector that groups moods by category and lets users choose one.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Modal prompting users to add a private note, showing optional micro‑action suggestions.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a mood status post with author info, mood styling, timestamps, and privacy indicators.",
  "frontend/src/constants/branding.ts": "Exports the application name constant.",
  "frontend/src/constants/contextTags.ts": "Defines predefined context tags and configuration limits for tag usage.",
  "frontend/src/constants/foundationCopy.ts": "Provides core app promise and boundary text strings.",
  "frontend/src/constants/loginCopy.ts": "Contains rotating login screen text and a helper to pick random phrases.",
  "frontend/src/constants/moods.ts": "Defines all mood options with labels, emojis, and categories.",
  "frontend/src/constants/sounds.ts": "Maps sound cue identifiers to asset paths for UI audio.",
  "frontend/src/constants/systemAvatars.ts": "Lists fixed system avatar metadata and helper to resolve avatar paths.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Context controlling visibility of the floating journal widget.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Context managing the open state and reset behavior of the journal overlay.",
  "frontend/src/contexts/SoundContext.tsx": "Provides a React context for sound settings, manages audio unlocking, and exposes functions to play specific sound cues.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to provide explicit error handling and a refetch option for actor initialization failures.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage authentication state, login, logout, and identity restoration.",
  "frontend/src/hooks/useJournal.ts": "Provides queries and mutations for fetching, creating, updating, and deleting journal entries via the backend actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a filtered and sorted mood history for the logged-in user based on recent feed status posts.",
  "frontend/src/hooks/useQueries.ts": "Defines profile, avatar, connection, feed, and notification queries and mutations using the backend actor.",
  "frontend/src/hooks/useSound.ts": "Thin wrapper exposing the SoundContext hook.",
  "frontend/src/index.css": "Defines global Tailwind styles and custom CSS variables for light/dark themes and layout-safe-area adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CirclePage.tsx": "Renders the main Circle view with tabs for members, requests, joining by code, and safe people, using feed data for the energy card.",
  "frontend/src/pages/CirclesImInPage.tsx": "Shows a list of circles the user belongs to, with loading and error states and owner avatars.",
  "frontend/src/pages/ClosestConnectionsPage.tsx": "Displays ranked closest connections with avatars and explanations, handling loading and error cases.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides a form to compose and post a mood status with audience selection, tags, and reminders.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Lets users submit a daily mood check-in with audience selection, enforcing a reminder guard.",
  "frontend/src/pages/FeedPage.tsx": "Shows the user's feed with status posts, silent signals, reminders, and refresh controls.",
  "frontend/src/pages/HomeRoutePage.tsx": "Routes users to public or authenticated home based on identity, wrapping the feed in app layout and profile checks.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Handles invite-code-based auth flow, loading stored codes, prompting login, and joining a circle after authentication.",
  "frontend/src/pages/NotificationsPage.tsx": "Fetches and displays unread and read notifications with navigation to related status pages.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the user profile, including avatar management, preferences, and pulse score.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page allowing users to enter an invite code or start account creation.",
  "frontend/src/pages/StartAuthPage.tsx": "Starts the login/signup process using Internet Identity and redirects after authentication.",
  "frontend/src/pages/StatusDetailPage.tsx": "Shows a single status post or access errors, with navigation back to the feed.",
  "frontend/src/utils/age.ts": "Provides age calculation and date conversion utilities for profile data.",
  "frontend/src/utils/audience.ts": "Builds a deduplicated Principal audience list that always includes the author.",
  "frontend/src/utils/circleEnergy.ts": "Filters posts to the last 7 days, derives mood-based vibe categories, and generates safe, seed‑stable summary phrases.",
  "frontend/src/utils/contextTags.ts": "Normalizes and validates custom context tags, checking emptiness, length, and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a one‑time sessionStorage flag for entering daily check‑in mode.",
  "frontend/src/utils/inviteCodeSession.ts": "Stores, retrieves, normalizes, and clears invite codes using sessionStorage.",
  "frontend/src/utils/microActions.ts": "Analyzes recent moods and context tags to generate conservative micro‑action suggestions from a small action library.",
  "frontend/src/utils/moodAnalysis.ts": "Computes mood distributions, trends, concern levels, and guidance with a non‑diagnostic disclaimer.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient class sets for UI styling.",
  "frontend/src/utils/moodReminder.ts": "Tracks daily dismissal of the mood reminder via localStorage and exposes show/dismiss helpers.",
  "frontend/src/utils/profileAvatar.ts": "Resolves avatar sources, validates uploads, converts files to bytes, and manages blob URL cleanup.",
  "frontend/src/utils/shareCode.ts": "Generates a six‑character uppercase alphanumeric share code without ambiguous characters.",
  "frontend/src/utils/soundPreferences.ts": "Reads and writes the user's sound‑enabled preference using localStorage with safe fallbacks.",
  "frontend/src/utils/time.ts": "Converts between backend nanosecond timestamps and JS Dates and provides helpers for day boundaries and formatting.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color tokens, container settings, and plugin integrations.",
  "project_state.json": "Tracks project version, current migration plan, architectural notes, and known issues for development coordination."
}