{
  "backend/main.mo": "Main Motoko canister defining core domain types (moods, genders, relationship intents, user profiles) and application logic, with authorization mixins and migration support. Acts as the primary backend actor for profiles, statuses, circles, journals, and notifications.",
  "backend/migration.mo": "Defines old and new actor/state schemas and transformation logic to migrate persisted canister data, notably adding contextTags to status posts. Used during canister upgrades to safely evolve stored data.",
  "feature_evidence.json": "Machine-readable report documenting implemented frontend features around context tags, including affected files, components, test requirements, and confidence levels. Serves as traceability evidence for feature delivery.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files describing each component’s responsibility and UI behavior. Used as documentation to quickly understand the frontend architecture.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles applied across the app. Establishes consistent theming, colors, and layout defaults.",
  "frontend/index.html": "Static HTML entry point that sets metadata and mounts the React application at the root div. Loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes, authentication/profile gates, theme provider, and global toaster notifications. Defines navigation for feed, profile, circle, compose, notifications, and status detail pages.",
  "frontend/src/components/app/AppHeader.tsx": "Sticky application header with branding and a user dropdown menu for profile navigation, journal access, and sign out. Integrates Internet Identity logout and displays the current user’s name.",
  "frontend/src/components/app/AppLayout.tsx": "Top-level application layout that wraps routes with header, footer navigation, floating journal FAB, and journal overlay, and provides journal visibility context.",
  "frontend/src/components/app/BottomNav.tsx": "Fixed bottom navigation bar with buttons for main routes, highlighting the active route and showing an unread notifications badge.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button that conditionally appears based on context visibility and navigates to the compose page.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that shows a loading spinner during initialization, renders a login panel if unauthenticated, or children when authenticated.",
  "frontend/src/components/auth/LoginPanel.tsx": "Full-screen login UI with branding, feature highlights, random motivational copy, and a button to trigger Internet Identity login.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Displays the current user’s circle members with profile details and allows removing members, excluding the current user.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form that lets users join a circle by entering a share code and submitting a join request with validation and feedback.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Panel for reviewing incoming circle join requests, showing requester profiles and allowing accept or decline actions.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Card for viewing, copying, editing, and updating the user’s share code with inline editing and persistence.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Conditional reminder card that prompts users to check in with their mood, with dismiss and quick navigation to compose.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "A button-triggered popover date picker for selecting a journal date, showing the formatted date and preventing future date selection.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Displays, creates, and deletes journal entries for a selected date, with editing allowed only for today and read-only access for past dates.",
  "frontend/src/components/journal/JournalOverlay.tsx": "A right-side sheet overlay that hosts the daily journal UI, managing the selected date and rendering the date picker and entries panel.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes recent mood history over a selectable timeframe and presents trends, concern levels, and top mood distributions in a card UI.",
  "frontend/src/components/profile/ProfileGate.tsx": "Guards access to the app by loading the caller’s profile and forcing profile setup if none exists before rendering children.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A multi-step onboarding dialog that collects user profile details, validates input, generates a share code, and saves the profile.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Allows users to select predefined or custom context tags for a status, with validation, soft limits, and tag removal.",
  "frontend/src/components/status/MoodPicker.tsx": "Provides a searchable, categorized grid for selecting a mood, supporting emoji-based buttons and optional autofocus on search.",
  "frontend/src/components/status/StatusCard.tsx": "React component that renders a status post card with author info, mood emoji/label, content, timestamp, and audience size, using identity to mark the current user's own posts.",
  "frontend/src/constants/branding.ts": "Defines the application name constant used for branding across the frontend.",
  "frontend/src/constants/contextTags.ts": "Exports predefined context tags and related limits for tagging content, including soft limits and max custom tag length.",
  "frontend/src/constants/loginCopy.ts": "Contains curated emotional copy for the login screen and a helper to pick a random phrase per session.",
  "frontend/src/constants/moods.ts": "Defines the full list of supported moods with labels, emojis, and categories, plus types and helpers for mapping backend mood values.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "React context and provider that manages visibility state for a floating journal UI with show/hide controls.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity, handling authentication, admin access initialization, and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context and hooks for Internet Identity login, logout, identity persistence, and login status tracking.",
  "frontend/src/hooks/useJournal.ts": "React Query hooks for fetching, creating, updating, and deleting journal entries via the backend actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Derives a chronological mood history for the current user over a given timeframe by filtering and transforming feed data.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profiles, join requests, sharing, feed-related data, and other backend interactions via the actor.",
  "frontend/src/index.css": "Sets up Tailwind base/styles and defines CSS variables for a calm light/dark color theme, typography, borders, and chart colors, plus safe-area utilities for mobile layouts.",
  "frontend/src/main.tsx": "Bootstraps the React app, wiring up React Query and Internet Identity providers before rendering the root App component.",
  "frontend/src/pages/CirclePage.tsx": "Renders the Circle management page with tabs for members, pending join requests (with count), and joining via share code.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides a form to compose and post a mood status, including mood selection, optional context tags, audience selection, validation, and submission handling.",
  "frontend/src/pages/FeedPage.tsx": "Displays the user feed with status updates, loading/empty states, manual refresh, and an optional mood check-in reminder card.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows unread and read notifications, allows marking notifications as read, and navigates to related status details when clicked.",
  "frontend/src/pages/ProfilePage.tsx": "Handles viewing and editing the user profile, including personal details, preferences, validation, and profile updates, with edit mode UI state.",
  "frontend/src/pages/StatusDetailPage.tsx": "Fetches and displays a single status by ID with loading, error/permission handling, and navigation back to the feed.",
  "frontend/src/utils/age.ts": "Utility functions to calculate age from a birthdate, format birthdates for inputs, and parse date strings into bigint timestamps.",
  "frontend/src/utils/contextTags.ts": "Provides helpers to normalize and validate custom context tags, enforcing non-empty values, max length, and case-insensitive uniqueness against existing tags.",
  "frontend/src/utils/moodAnalysis.ts": "Analyzes a list of mood entries to compute distributions, dominant mood, sentiment trend, concern level, and user guidance, with a built-in non-medical disclaimer.",
  "frontend/src/utils/moodReminder.ts": "Manages a once-per-day mood check-in reminder using localStorage, including helpers to check, dismiss, and decide whether to show the reminder.",
  "frontend/src/utils/shareCode.ts": "Generates a random, user-friendly 6-character alphanumeric share code for onboarding and invitations.",
  "frontend/src/utils/time.ts": "Contains date and time utilities for converting between backend nanosecond timestamps and JS Date, plus helpers for day boundaries, comparisons, and formatting.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash routing), persisting them in sessionStorage, and safely clearing sensitive parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, custom color system via CSS variables, typography, animations, and design tokens.",
  "project_state.json": "High-level project state and feature inventory describing the app vision, current versioning, and implemented features such as authentication, profiles, share codes, circles, moods, and notifications."
}