{
  "backend/main.mo": "Defines mood, gender, relationship intent, and user profile types with conversion helpers inside an actor canister.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for reference or tooling.",
  "frontend/index.css": "Tailwind base/theme CSS defining light and dark mode design tokens and global styles.",
  "frontend/index.html": "Base HTML document mounting the app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router, React Query, theme provider, and global sound provider, defining all main routes.",
  "frontend/src/components/app/AppFooter.tsx": "Empty file placeholder for a removed footer component.",
  "frontend/src/components/app/AppHeader.tsx": "Header with app title, theme toggle, journal button, and user dropdown including profile and sign‑out actions.",
  "frontend/src/components/app/AppLayout.tsx": "Top‑level layout with header, routed content, bottom nav, floating journal button, overlay, and sound effects manager.",
  "frontend/src/components/app/BottomNav.tsx": "Fixed bottom navigation bar with icon‑based route buttons and unread notifications badge logic.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button for creating a new status, shown or hidden based on journal visibility context.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Icon button that switches between light and dark themes using next‑themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper showing loading, login panel, or app children based on Internet Identity state.",
  "frontend/src/components/auth/LoginPanel.tsx": "Renders the main login UI using Internet Identity with randomized copy, error handling, and a progressive disclosure section.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays a summary of circle activity by generating an energy description from a list of posts.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Shows current circle members with profile details and allows removing members via confirmation dialogs.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Provides a form to enter and submit a share code to request joining another user's circle.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Lists pending join requests with requester profile info and actions to accept or decline each request.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Lets users select up to two Safe People from eligible candidates with toggle actions and loading states.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Displays the user’s share code with copy and edit functionality, allowing updates that invalidate pending requests.",
  "frontend/src/components/common/IconActionButton.tsx": "A button component that displays an icon with a tooltip using a wrapped Button and Tooltip.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "A collapsible section with a trigger button that reveals content, styled with optional variants.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "A reminder card prompting users to complete a mood check-in with options to dismiss or navigate to the check‑in page.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Displays a silent signal entry with mood styling, author info, and timestamp, highlighting if it belongs to the current user.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Allows users to send predefined silent signals to Safe People, showing setup prompts or send buttons with loading states.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "A popover date picker for journal entries using a button trigger and calendar selection.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Manages viewing, adding, and deleting journal entries for a selected date with edit restrictions for past days.",
  "frontend/src/components/journal/JournalOverlay.tsx": "A slide‑in journal interface combining rules, date selection, and entry management.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Shows personalized micro‑action suggestions based on mood history or fallback guidance when insufficient data exists.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Displays mood analysis over a selected timeframe, showing trends, concern levels, top moods, and related micro‑actions.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates access based on profile load state, handling loading, errors, and onboarding flow before rendering children.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides users through multi‑step profile creation, validating inputs and saving the completed profile.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Listens for new notifications, feed items, join requests, and circle members to trigger appropriate sound effects.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Allows selecting predefined context tags or adding custom ones with validation and soft‑limit feedback.",
  "frontend/src/components/status/MoodPicker.tsx": "Provides searchable, categorized mood selection with visual cues and selection highlighting.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Modal prompt suggesting micro‑actions and offering to open a private journal note after a status post.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a user’s mood status with author info, timestamp, mood styling, and optional audience count.",
  "frontend/src/constants/branding.ts": "Exports the app name constant.",
  "frontend/src/constants/contextTags.ts": "Defines predefined context tags plus limits for tag count and custom tag length.",
  "frontend/src/constants/foundationCopy.ts": "Provides short foundational messaging describing the app’s promise and boundaries.",
  "frontend/src/constants/loginCopy.ts": "Contains rotating login screen phrases and a helper to pick a random one.",
  "frontend/src/constants/moods.ts": "Lists all mood options with labels, emojis, and categories mapped to backend mood values.",
  "frontend/src/constants/sounds.ts": "Defines sound asset paths and the SoundCue type.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Context controlling visibility of the floating journal UI with show/hide methods.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Context managing the journal overlay’s open state and reset behavior.",
  "frontend/src/contexts/SoundContext.tsx": "Sound context managing preference, audio unlocking, and playback for app sound cues.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor based on identity and invalidating dependent queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Wrapper around useActor adding error tracking and refetch capability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for managing Internet Identity auth, exposing identity state, login/clear actions, and status flags using Dfinity's AuthClient.",
  "frontend/src/hooks/useJournal.ts": "React Query hooks to fetch, create/update, and delete journal entries via the backend actor, with cache invalidation.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a user's mood history from feed data filtered by timeframe and identity, returning sorted mood entries.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profiles, share codes, join requests, feed items, and status actions with mutation helpers and cache updates.",
  "frontend/src/hooks/useSound.ts": "Thin wrapper exposing the SoundContext hook.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark themes, mood colors, and safe-area utilities.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CirclePage.tsx": "Circle overview page showing energy, members, join requests, join form, and safe people using tabbed navigation.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Status composer page allowing mood selection, audience picking, context tags, and posting updates with optional journal prompt.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Daily check-in form allowing users to select mood, write content, choose audience, and submit a status with optional private note prompt.",
  "frontend/src/pages/FeedPage.tsx": "Displays the user's feed with status updates, silent signals, and a mood reminder, including refresh and empty-state handling.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows unread and read notifications, supports marking as read, and navigates to related status details.",
  "frontend/src/pages/ProfilePage.tsx": "User profile view and editor allowing updates to personal details, preferences, and settings with validation.",
  "frontend/src/pages/StatusDetailPage.tsx": "Loads and displays a single status with error handling and navigation back to the feed.",
  "frontend/src/utils/age.ts": "Utility functions for calculating age, formatting dates, and parsing date input values.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent status posts to categorize circle mood and generate a weekly energy summary.",
  "frontend/src/utils/contextTags.ts": "Provides helpers to normalize and validate custom tags, checking emptiness, length, and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Implements a one-time sessionStorage guard for entering daily check‑in mode.",
  "frontend/src/utils/microActions.ts": "Defines micro‑actions and generates suggestions based on recent moods and context tags using simple rule logic.",
  "frontend/src/utils/moodAnalysis.ts": "Analyzes mood history to compute distributions, trends, concern levels, and guidance with a built‑in disclaimer.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient class strings for styling.",
  "frontend/src/utils/moodReminder.ts": "Manages a once‑per‑day mood reminder using localStorage to track dismissal by date.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric onboarding share code without ambiguous characters.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets a boolean sound‑enabled preference stored in localStorage.",
  "frontend/src/utils/time.ts": "Provides time conversion between bigint nanoseconds and Date plus common date utility helpers.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter extraction, persistence via sessionStorage, and cleanup for both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, content scanning, custom OKLCH color system, extended utilities, and plugin setup.",
  "project_state.json": "Project metadata describing current app state, high‑level product summary, and a list of implemented features with versions."
}