{
  "backend/main.mo": "Defines an actor with extensive Mood and Gender variants plus text conversion helpers for each.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of multiple frontend files for build-planning reference.",
  "frontend/index.css": "Tailwind base/theme definitions with light and dark CSS variable palettes and global element styling.",
  "frontend/index.html": "HTML root document mounting the app and loading the main TypeScript entry.",
  "frontend/index.ts": "Empty TypeScript entry file placeholder.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and global providers including theme, query client, and sound context.",
  "frontend/src/components/app/AppFooter.tsx": "Empty placeholder file for an app footer component.",
  "frontend/src/components/app/AppHeader.tsx": "Header with app branding, theme toggle, journal button, and user menu including profile and logout actions.",
  "frontend/src/components/app/AppLayout.tsx": "Authenticated app layout with header, bottom nav, journal overlays, logout redirect handling, and routed content.",
  "frontend/src/components/app/BottomNav.tsx": "Renders a fixed bottom navigation bar with icons, active-state highlighting, and unread notifications badges.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Displays a floating action button for composing a new journal entry when visibility is enabled.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Provides a button to toggle between light and dark themes using next-themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Gates content behind Internet Identity authentication, showing a loader or login panel as needed.",
  "frontend/src/components/auth/LoginPanel.tsx": "Shows a styled login screen with randomized copy, feature highlights, error handling, and Internet Identity login.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays a summary of circle energy generated from posts using a styled card layout.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Lists circle members with profile data, pulse scores, and the ability to remove members.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form for submitting a share code to request joining a circle with validation and feedback.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Shows pending join requests with profile details and actions to accept or decline.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selection of up to two safe people with recommendations, profile lookup, and backend updates.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Displays and edits the user's share code with copy, edit, and save actions backed by mutations.",
  "frontend/src/components/common/IconActionButton.tsx": "Wraps a button with an icon and tooltip, forwarding all button props.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Provides a collapsible section with a trigger button and animated content area.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Shows a daily mood check‑in reminder card with navigation and dismiss handling.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Renders a silent signal entry with mood display, author info, and styling based on mood category.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Lets users send predefined silent signals to Safe People, handling setup checks and send state.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Popover date picker for journal entries, preventing future dates and updating selection.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Displays journal entries for a date with creation, deletion, and editing limited to today.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Right‑side sheet showing the journal with rules, date picker, and entries panel.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Displays micro-action suggestions based on mood history, with a fallback message when data is insufficient.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood trends and distributions over a selected timeframe and shows results along with micro-action suggestions.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Provides UI for selecting system avatars or uploading custom images with validation and preview handling.",
  "frontend/src/components/profile/ProfileGate.tsx": "Handles profile loading, error states, and triggers onboarding if the user has no profile.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Onboarding flow for creating a user profile, collecting name, gender, birthdate, preferences, and generating a share code.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Plays sound effects when new notifications, feed items, join requests, or circle member changes are detected.",
  "frontend/src/components/status/AudienceSelector.tsx": "UI component for choosing post audience, including radio options and selectable circle members with profiles and ages.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Picker for predefined and custom context tags with validation and selected tag management.",
  "frontend/src/components/status/MoodPicker.tsx": "Mood selection UI with search, category grouping, and color‑coded mood buttons.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Alert dialog prompting users to write a private note and showing micro‑action suggestions.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a status post with author info, mood styling, audience privacy indicators, and timestamp.",
  "frontend/src/constants/branding.ts": "Defines the application name constant.",
  "frontend/src/constants/contextTags.ts": "Defines predefined context tags, soft limits, and custom tag length config.",
  "frontend/src/constants/foundationCopy.ts": "Contains core app promise and boundary text.",
  "frontend/src/constants/loginCopy.ts": "Provides login screen phrases and a helper to pick a random one.",
  "frontend/src/constants/moods.ts": "Defines all mood options with labels, emojis, and categories.",
  "frontend/src/constants/sounds.ts": "Exports sound asset paths and a type for sound cues.",
  "frontend/src/constants/systemAvatars.ts": "Defines a fixed list of system avatars with IDs and paths plus a helper to look up paths by ID.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "React context managing visibility state for a floating journal with show/hide controls.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Provides state and controls for opening and closing the journal overlay, including reset-to-today behavior.",
  "frontend/src/contexts/SoundContext.tsx": "Manages global sound settings, audio unlocking, and playback functions for notification-related sounds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor with additional error tracking and a refetchable query for actor initialization status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout logic, and persistence using AuthClient.",
  "frontend/src/hooks/useJournal.ts": "Hooks for querying, creating, updating, and deleting journal entries via the backend actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a filtered, sorted mood history for the current user from recent feed status posts.",
  "frontend/src/hooks/useQueries.ts": "Collection of react‑query hooks for user profiles, avatars, requests, posts, notifications, and related mutations.",
  "frontend/src/hooks/useSound.ts": "Simple wrapper returning the sound context.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark mode CSS variables plus safe-area padding utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CirclePage.tsx": "Renders the Circle page with tabs for members, requests, joining, and safe people, including circle energy status.",
  "frontend/src/pages/CirclesImInPage.tsx": "Displays circles the user belongs to with loading, error, and empty states.",
  "frontend/src/pages/ClosestConnectionsPage.tsx": "Shows ranked closest connections with loading/error handling and progressive disclosure details.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides a status composer with mood, content, audience selection, context tags, and post submission logic.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Implements the daily check-in flow with mood selection, audience options, and guard-based navigation.",
  "frontend/src/pages/FeedPage.tsx": "Displays the feed with refresh, reminder, composer, and cards for statuses or silent signals.",
  "frontend/src/pages/HomeRoutePage.tsx": "Routes users to public home, feed, or loading state based on Internet Identity status.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Handles invite-code-based login flow, auto-joining a circle after authentication.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows notifications, allows marking them read, and links to related statuses.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits user profile, avatar, preferences, and pulse score.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page with invite code entry and onboarding info.",
  "frontend/src/pages/StartAuthPage.tsx": "Launches Internet Identity login and redirects to the app after authentication.",
  "frontend/src/pages/StatusDetailPage.tsx": "Displays a single status post with loading, error, and permission handling plus navigation back to the feed.",
  "frontend/src/utils/age.ts": "Provides helpers to calculate age, format a date for input, and parse date strings into bigint timestamps.",
  "frontend/src/utils/audience.ts": "Builds a unique audience list for a post, always including the author.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent posts to derive a weekly vibe and generates a seeded, non-clinical summary phrase.",
  "frontend/src/utils/contextTags.ts": "Normalizes and validates user-defined context tags, checking length and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a sessionStorage guard flag for one-time daily check‑in entry.",
  "frontend/src/utils/inviteCodeSession.ts": "Stores, retrieves, clears, and normalizes invite codes in sessionStorage.",
  "frontend/src/utils/microActions.ts": "Suggests brief micro‑actions based on recent mood patterns and context tags using conservative rules.",
  "frontend/src/utils/moodAnalysis.ts": "Computes mood distribution, trends, concern level, and guidance with a non-clinical disclaimer.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient classes for UI styling.",
  "frontend/src/utils/moodReminder.ts": "Controls a once‑per‑day mood reminder using localStorage to track dismissal.",
  "frontend/src/utils/profileAvatar.ts": "Utilities for deriving avatar image sources, validating avatar uploads, converting files to byte arrays, and revoking blob URLs.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric, ambiguity‑free share code.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets a boolean sound‑enabled preference in localStorage with safe fallbacks.",
  "frontend/src/utils/time.ts": "Helpers for converting between bigint timestamps and Date, checking date ranges, and formatting dates.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, sizing, plugins, and extended design tokens.",
  "project_state.json": "Project metadata summarizing current architecture, planned membership changes, and known issues."
}