{
  "backend/main.mo": "Defines a large Mood variant type with a toText converter and a Gender type with similar utilities inside an actor canister.",
  "feature_evidence.json": "Feature evidence report describing a UI change to display a bell icon next to circle members, listing affected file, components, and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend React files detailing layout, routing, onboarding, and UI behavior.",
  "frontend/index.css": "Tailwind CSS config defining light and dark theme CSS variables and applying global background and text styles.",
  "frontend/index.html": "Basic HTML shell loading the root div and main React entry script.",
  "frontend/index.ts": "Empty placeholder TypeScript entry file.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, React Query, theming, and the app’s global providers including sound and toast systems.",
  "frontend/src/components/app/AppFooter.tsx": "Footer component rendering attribution text and a dynamic Caffeine.ai referral link.",
  "frontend/src/components/app/AppHeader.tsx": "Header with branding, theme toggle, journal button, user menu, and improved logout logic clearing cache and redirecting home.",
  "frontend/src/components/app/AppLayout.tsx": "Authenticated app layout with header, bottom nav, footer, journal overlay, and logout-based redirect protection.",
  "frontend/src/components/app/BottomNav.tsx": "Renders a bottom navigation bar with icons, active state highlighting, and an unread notifications badge.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Displays a floating action button for composing a new journal entry when visible.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Provides a button to toggle between light and dark themes using next-themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Blocks content until Internet Identity initializes and shows login panel if user is not authenticated.",
  "frontend/src/components/auth/LoginPanel.tsx": "Shows the login UI with branding, randomized copy, error handling, and triggers Internet Identity login.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays a generated emotional-energy summary for circle posts inside a styled card.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Lists circle members with profile details, pulse scores, and supports removing members.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form allowing a user to request circle access by entering a share code.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Shows pending join requests with profile info and lets the user accept or decline them.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selection of up to two Safe People, showing recommendations and profile details with add/remove actions.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Displays and edits a user's share code with copy, edit, and save actions using query hooks.",
  "frontend/src/components/common/IconActionButton.tsx": "A button component that shows an icon with a tooltip wrapper.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible section component with a trigger button and optional default open state.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Shows a daily reminder card prompting a mood check-in with dismiss and navigation actions.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Displays a silent signal entry with author info, mood styling, and timestamp.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Lets users send predefined silent signals to Safe People, with setup prompts if none exist.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "A popover date picker for selecting journal dates, preventing future dates.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Shows journal entries for a selected date with create, update, and delete options when editable.",
  "frontend/src/components/journal/JournalOverlay.tsx": "A right-side sheet showing journal UI with rules, date picker, and entries panel.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Displays suggested micro-actions based on mood history, with a fallback for insufficient data and a disclaimer section.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood trends and distributions over a selected timeframe and displays insights along with the MicroActionsPanel.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Lets users preview, select, and upload profile avatars with validation and automatic cleanup of preview URLs.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates access based on user profile status, handling loading, errors, profile setup, and retries.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides new users through a multi-step onboarding flow to create and save their profile details.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Plays sound effects when new notifications, feed items, join requests, or circle members are detected after initial load.",
  "frontend/src/components/status/AudienceSelector.tsx": "UI component for selecting post audience, including specific members and safe people, with dynamic member filtering and selection.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Tag selection component allowing predefined and custom tags with validation and soft limits.",
  "frontend/src/components/status/MoodPicker.tsx": "Searchable mood selector that groups moods by category and lets users choose one with visually coded buttons.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Modal prompting users to add a private note, optionally showing micro‑action suggestions based on mood history.",
  "frontend/src/components/status/StatusCard.tsx": "Displays an individual status post with mood styling, author info, timestamps, and private‑audience indicators.",
  "frontend/src/constants/branding.ts": "Defines the application name constant.",
  "frontend/src/constants/contextTags.ts": "Provides predefined context tags and configuration values like soft limits and max custom tag length.",
  "frontend/src/constants/foundationCopy.ts": "Contains the app’s core promise and boundary copy text.",
  "frontend/src/constants/loginCopy.ts": "Holds rotating login screen text snippets and a helper to pick random phrases.",
  "frontend/src/constants/moods.ts": "Defines mood options with labels, emojis, and categories for the mood‑selection UI.",
  "frontend/src/constants/sounds.ts": "Maps sound cue identifiers to asset paths for UI audio feedback.",
  "frontend/src/constants/systemAvatars.ts": "Defines a fixed list of system avatar IDs and file paths plus a helper to look up an avatar path by ID.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Provides a React context to control visibility of a floating journal UI with show and hide methods.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Creates a context managing journal overlay open state and reset options, exposing open and close functions.",
  "frontend/src/contexts/SoundContext.tsx": "Implements global sound settings, audio unlocking, and playback functions for notification-related cues.",
  "frontend/src/hooks/useActor.ts": "Builds and caches an authenticated or anonymous backend actor and invalidates related queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to provide error detection and refetching when actor initialization fails.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/clear actions, and initialization via AuthClient.",
  "frontend/src/hooks/useJournal.ts": "Supplies queries and mutations for retrieving, creating, updating, and deleting journal entries.",
  "frontend/src/hooks/useMoodHistory.ts": "Computes the user's recent mood history from feed items filtered by timeframe and identity.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for profiles, avatars, statuses, notifications, and other backend data operations.",
  "frontend/src/hooks/useSound.ts": "Simple wrapper hook that returns the sound context value.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark CSS variables plus safe-area padding utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CirclePage.tsx": "Renders the Circle overview with energy, members, requests, join options, and safe people tabs.",
  "frontend/src/pages/CirclesImInPage.tsx": "Shows a list of circle owners the user belongs to, with loading and error states.",
  "frontend/src/pages/ClosestConnectionsPage.tsx": "Displays ranked closest connections with loading/error handling and detailed explanations.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides UI for composing a status with mood, tags, audience selection, and submission logic.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Implements the daily check‑in flow with mood, content, audience, guard checks, and posting logic.",
  "frontend/src/pages/FeedPage.tsx": "Renders the main feed with refresh, reminders, composer, and a list of status or silent signal items.",
  "frontend/src/pages/HomeRoutePage.tsx": "Routes users to public home, loading screen, or feed based on identity state.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Handles invite-code-based onboarding, login flow, and joining a circle using a stored invite code.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows unread and read notifications, supports marking them read, and navigation to linked statuses.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits user profile details, avatar, gender preferences, and pulse score.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page allowing invite-code entry or account creation with feature explanations.",
  "frontend/src/pages/StartAuthPage.tsx": "Prompts users to log in or create an account and redirects after successful authentication.",
  "frontend/src/pages/StatusDetailPage.tsx": "Displays a single status with loading, error, and permission handling, and links back to the feed.",
  "frontend/src/utils/age.ts": "Provides utilities to calculate age from a bigint timestamp and convert dates to and from input-friendly formats.",
  "frontend/src/utils/audience.ts": "Builds a unique audience list for a post, ensuring the author is always included.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent posts to derive a weekly vibe and generates seeded, non-clinical summary phrases.",
  "frontend/src/utils/contextTags.ts": "Normalizes and validates custom context tags, checking length and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a one-time session guard flag for entering daily check‑in mode.",
  "frontend/src/utils/inviteCodeSession.ts": "Stores, retrieves, normalizes, and clears invite codes in sessionStorage.",
  "frontend/src/utils/microActions.ts": "Suggests short non‑clinical micro‑actions based on recent mood patterns and context tags.",
  "frontend/src/utils/moodAnalysis.ts": "Computes mood distribution, trends, concern levels, and generates guidance with a built‑in disclaimer.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind class sets and gradients for consistent UI styling.",
  "frontend/src/utils/moodReminder.ts": "Controls once‑per‑day mood reminder visibility using localStorage and local date checks.",
  "frontend/src/utils/profileAvatar.ts": "Helpers for generating avatar image URLs from profile data, validating avatar files, converting files to bytes, and revoking object URLs.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric share code using non‑ambiguous characters.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets a boolean sound‑enabled preference using localStorage with safe fallbacks.",
  "frontend/src/utils/time.ts": "Provides date/time converters between bigint nanoseconds and JS Date plus helpers for day boundaries, comparisons, and formatting.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash‑based), persisting them in sessionStorage, and clearing stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, container settings, and plugin usage.",
  "project_state.json": "Metadata describing project state, including a feature to show a bell icon next to circle members for a ping feature."
}