{
  "backend/main.mo": "Defines data types for moods, gender, relationship intent, avatars, and user profiles, with helper modules for converting variants to text.",
  "feature_evidence.json": "Lists implemented feature reports, each mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of each major frontend file.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and applying global base styles.",
  "frontend/index.html": "HTML entry point that sets metadata and loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router route tree, authentication gates, and global providers like theme, sound, and React Query.",
  "frontend/src/components/app/AppFooter.tsx": "Empty placeholder file for the app footer component.",
  "frontend/src/components/app/AppHeader.tsx": "Renders the app header with branding, theme toggle, journal button, and user dropdown including profile and sign-out actions.",
  "frontend/src/components/app/AppLayout.tsx": "Wraps pages with header, bottom nav, journal overlay, and sound manager, supporting both Outlet-based and direct-children rendering.",
  "frontend/src/components/app/BottomNav.tsx": "Implements the fixed bottom navigation bar with icon-first buttons, active state styling, and unread notification badges.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button that appears when visible and navigates to the compose page.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Theme toggle button switching between light and dark modes.",
  "frontend/src/components/auth/AuthGate.tsx": "Wrapper that shows a loading screen, login panel, or authenticated content based on identity state.",
  "frontend/src/components/auth/LoginPanel.tsx": "Login UI panel with randomized copy, error handling, and Internet Identity login flow.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays a generated summary of circle energy inside a styled card.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Lists circle members with profiles, age, and removal actions, excluding the current user.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form for entering a share code to request joining a circle, with validation and toast feedback.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Displays pending join requests with profile info and accept or decline actions.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selection of up to two safe people from eligible candidates with profile lookups and mutation handling.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Card for viewing, copying, editing, and saving a user's share code with validation and mutation handling.",
  "frontend/src/components/common/IconActionButton.tsx": "Re-usable button with icon, tooltip, and optional children using shadcn button and tooltip components.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible section with a trigger button that expands to reveal additional content.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Displays a mood check‑in reminder with actions to navigate to check‑in or dismiss for the day.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Shows a silent signal post with author info, mood styling, timestamp, and content.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Allows sending predefined silent signals to safe people, with validation and status handling.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Popover calendar picker for selecting journal entry dates, preventing future dates.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Displays and manages journal entries for a selected date, including creation, deletion, and read‑only past dates.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Right-side sheet containing date picker, rules, and entries panel for journal management.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Displays micro‑action suggestions based on mood history, falling back to an info message when data is insufficient.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood history over a selected timeframe and shows trends, distribution, and micro‑action suggestions.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Allows users to select or upload an avatar with validation, preview, and change propagation to the parent component.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates profile‑dependent content, handling loading, errors, and showing setup flow when a profile is missing.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides new users through a multi‑step profile setup flow and saves the completed profile.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Listens for new notifications, feed items, join requests, or circle members and plays corresponding sound effects.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Tag picker UI allowing selection of predefined tags and adding/removing custom tags with validation.",
  "frontend/src/components/status/MoodPicker.tsx": "Searchable mood selector that groups moods by category and highlights the selected option.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Modal prompting users to add a private note and optionally showing suggested micro‑actions based on mood history.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a mood status post with author info, mood styling, timestamps, and optional private/audience indicators.",
  "frontend/src/constants/branding.ts": "Defines the application's brand name constant.",
  "frontend/src/constants/contextTags.ts": "Defines predefined context tags and related configuration limits for tagging.",
  "frontend/src/constants/foundationCopy.ts": "Provides core application promise and boundary text snippets.",
  "frontend/src/constants/loginCopy.ts": "Contains rotating login screen copy and a helper to pick random phrases.",
  "frontend/src/constants/moods.ts": "Defines all mood options with labels, emojis, categories, and types.",
  "frontend/src/constants/sounds.ts": "Defines sound asset paths and type-safe keys for UI sound cues.",
  "frontend/src/constants/systemAvatars.ts": "Lists system avatar metadata and exposes a lookup function by avatar ID.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Context controlling visibility of the floating journal with show/hide actions.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Context managing the journal overlay’s open state and reset‑to‑today behavior.",
  "frontend/src/contexts/SoundContext.tsx": "Provides a React sound context that manages audio unlocking, user preferences, and playback for notification-related cues.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to expose error state and refetch logic for actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook that manages login, stored identity loading, and auth client configuration.",
  "frontend/src/hooks/useJournal.ts": "Provides queries and mutations for fetching, creating, updating, and deleting journal entries via the actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a chronological mood history for the logged-in user by filtering and mapping feed status posts.",
  "frontend/src/hooks/useQueries.ts": "Contains profile, avatar, and other backend-related data queries and mutations that rely on the actor.",
  "frontend/src/hooks/useSound.ts": "Simple wrapper hook that returns the SoundContext values.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, color variables, and safe-area utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CirclePage.tsx": "Renders the Circle page with energy stats and tabbed sections for members, join requests, joining by code, and safe people. Fetches circle feed and pending requests to display counts and status posts.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides a full status composer with mood selection, content input, audience controls, context tags, and status submission logic. Loads circle members and profiles and handles audience pruning and optional reminder behavior.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Handles the guided daily check‑in flow with mood selection, content input, audience controls, and reminder‑based access guard. Submits a status and pulls circle members, profiles, and recent mood history.",
  "frontend/src/pages/FeedPage.tsx": "Displays the user's feed with status updates, silent signals, and optional mood‑check reminders. Supports refresh actions and empty‑state onboarding guidance.",
  "frontend/src/pages/HomeRoutePage.tsx": "Routes users to either the public homepage or the authenticated feed depending on identity state. Wraps authenticated content in profile and app layout gates.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Handles login and circle‑joining when navigating via an invite code, including storing, editing, and automatically consuming the code. Performs join mutations after login and redirects appropriately on success or error.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows unread and read notifications, marking items as read and navigating to related statuses. Handles empty states and includes a disclosure about future push notification support.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page that loads current profile, allows editing fields and avatar, and saves updates via API mutations.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page presenting app info and handling invite code entry or account creation navigation.",
  "frontend/src/pages/StartAuthPage.tsx": "Authentication start page that triggers Internet Identity login and redirects upon success.",
  "frontend/src/pages/StatusDetailPage.tsx": "Displays a single status post with loading and permission error states, offering navigation back to the feed.",
  "frontend/src/utils/age.ts": "Helpers for calculating age and converting between bigint timestamps and date input formats.",
  "frontend/src/utils/audience.ts": "Builds the final audience list for a status post, ensuring the author is always included.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent posts to categorize overall circle mood and generate an abstract summary phrase.",
  "frontend/src/utils/contextTags.ts": "Validates and normalizes custom context tags, handling length, emptiness, and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a session-based guard flag for one-time daily check-in entry logic.",
  "frontend/src/utils/inviteCodeSession.ts": "Handles storing, normalizing, retrieving, and clearing invite codes in session storage.",
  "frontend/src/utils/microActions.ts": "Defines micro‑action types, a small action library, mood classification helpers, and a rule engine that suggests actions based on recent mood patterns and context tags.",
  "frontend/src/utils/moodAnalysis.ts": "Analyzes mood history to compute distributions, trends, concern levels, and guidance, including sentiment classification and dominant mood detection.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient class sets for consistent UI styling.",
  "frontend/src/utils/moodReminder.ts": "Manages once‑per‑day mood reminder visibility using localStorage and date helpers.",
  "frontend/src/utils/profileAvatar.ts": "Builds displayable avatar URLs from profile data, validates uploads, and converts files to byte arrays.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric share code without ambiguous characters.",
  "frontend/src/utils/soundPreferences.ts": "Stores and retrieves sound‑enabled user preference in localStorage with a default of enabled.",
  "frontend/src/utils/time.ts": "Converts between bigint nanosecond timestamps and JS Dates and provides date utility helpers.",
  "frontend/src/utils/urlParams.ts": "Parses URL and hash params, persists them in sessionStorage, and provides helpers for retrieval and cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, extended theme options, and plugin integrations.",
  "project_state.json": "Project metadata defining versioned feature descriptions, scopes, and existing functionality across authentication, routing, profile gating, and backend access control."
}