{
  "backend/main.mo": "Defines user profile, mood, gender, and relationship intent types with text conversions inside an actor canister.",
  "feature_evidence.json": "Feature evidence report mapping a sound-provider wrapping change to affected files, components, and tests.",
  "frontend-file-summaries.txt": "JSON-style file describing summaries of multiple frontend files for reference or tooling.",
  "frontend/index.css": "Tailwind CSS base/theme variable definitions for light and dark modes plus global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app setup with theme, query client, router, and global SoundProvider wrapping all routes.",
  "frontend/src/components/app/AppFooter.tsx": "Footer component showing app credits and an ICP logo.",
  "frontend/src/components/app/AppHeader.tsx": "Top navigation header with theme toggle, journal button, and user menu with profile and logout.",
  "frontend/src/components/app/AppLayout.tsx": "App layout with header, footer, bottom nav, journal overlay, and sound effects manager around routed content.",
  "frontend/src/components/app/BottomNav.tsx": "Fixed bottom navigation bar with icon-first buttons and unread notifications badge.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button for composing a new entry when visible.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Icon toggle switching between dark and light themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Gate that shows loading, login, or authenticated children based on Internet Identity state.",
  "frontend/src/components/auth/LoginPanel.tsx": "Login screen using Internet Identity, showing branding, randomized subtext, and a button to start login with error handling.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays an energy summary for a circle by generating text from the provided posts.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Shows circle members with profile info and lets the user remove members, excluding themselves.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form to enter a share code and send a join-circle request with validation and toast feedback.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Lists pending join requests with profile details and actions to accept or decline each.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selection of up to two Safe People from eligible candidates with profile lookup and toggle handling.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Displays the user’s share code with copy and edit capabilities, including updating and normalizing new codes.",
  "frontend/src/components/common/IconActionButton.tsx": "Reusable button component that shows an icon with tooltip support and optional children.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible section component with a button trigger and optional open state.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Reminder card prompting users to complete a mood check-in with dismiss and navigation actions.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Displays a silent signal entry with author info, mood styling, and timestamp.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Lets users send predefined silent signals to safe people, handling loading and setup states.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Popover date picker for selecting journal dates, limited to today or earlier.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Manages viewing, creating, and deleting journal entries for a selected date with edit restrictions.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Slide‑in journal UI combining rules, date selection, and entry management.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Shows personalized micro‑action suggestions or fallback guidance based on mood history.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood trends and distribution over a timeframe, showing insights and related micro‑actions.",
  "frontend/src/components/profile/ProfileGate.tsx": "Wrapper that loads the user's profile, shows loading or error states, triggers profile setup if needed, and otherwise renders children.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Multi‑step onboarding dialog that collects user details and saves a new profile.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Background component that plays sounds when new notifications, feed items, join requests, or circle members appear.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "UI for selecting predefined or custom context tags with validation and soft limits.",
  "frontend/src/components/status/MoodPicker.tsx": "Searchable mood selector that groups moods by category and highlights the selected option.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Dialog prompting users to write a private note and optionally showing micro‑action suggestions based on mood history.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a status post with author info, mood styling, timestamp, and optional audience count.",
  "frontend/src/constants/branding.ts": "Defines the application name constant.",
  "frontend/src/constants/contextTags.ts": "Provides predefined context tags and limits for custom tags.",
  "frontend/src/constants/foundationCopy.ts": "Contains core app promise and boundary text strings.",
  "frontend/src/constants/loginCopy.ts": "Defines rotating login screen text and a helper to pick random phrases.",
  "frontend/src/constants/moods.ts": "Lists mood options with labels, emojis, and categories mapped to backend Mood values.",
  "frontend/src/constants/sounds.ts": "Declares sound asset paths and an associated type for sound cues.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Context managing visibility of a floating journal UI with show/hide controls.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Context controlling the journal overlay's open state and reset-to-today behavior.",
  "frontend/src/contexts/SoundContext.tsx": "Context handling sound preferences, audio unlocking, and playback helpers.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to the current identity and invalidating dependent queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Wrapper hook adding error tracking and refetching on top of useActor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/clear actions, and initializes AuthClient.",
  "frontend/src/hooks/useJournal.ts": "Hooks for querying, creating, updating, and deleting journal entries via the backend actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a user's chronological mood history from feed status posts within a timeframe.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles, join requests, share codes, and other backend data.",
  "frontend/src/hooks/useSound.ts": "Exports a simple hook that returns the sound context.",
  "frontend/src/index.css": "Sets Tailwind layers and CSS variables for light/dark themes, layout, and safe-area utilities.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/CirclePage.tsx": "Renders the Circle page with tabs for members, requests, joining, and safe people, using feed and request data.",
  "frontend/src/pages/ComposeStatusPage.tsx": "UI for composing and sharing a status with mood, content, tags, and audience selection.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Daily check‑in flow for posting a mood update with guard logic and recent mood history.",
  "frontend/src/pages/FeedPage.tsx": "Renders the main feed with refresh, mood reminder, composer, and feed items or empty state messaging.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays unread and read notifications, supports marking as read, and shows loading or empty states.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits the user's profile fields, handling validation, saving, and UI state toggles.",
  "frontend/src/pages/StatusDetailPage.tsx": "Fetches and displays a single status with loading and error handling, plus navigation back to the feed.",
  "frontend/src/utils/age.ts": "Utility functions for age calculation, formatting birthdates, and parsing date input.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent posts to derive a vibe summary, with mood categorization, seeding, and banned-term filtering.",
  "frontend/src/utils/contextTags.ts": "Validates and normalizes custom tags, checking for emptiness, length, and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Implements a sessionStorage guard for one-time daily check‑in entry behavior.",
  "frontend/src/utils/microActions.ts": "Defines micro-action types, mood classification helpers, and a rule engine that suggests short actions based on mood history and context tags.",
  "frontend/src/utils/moodAnalysis.ts": "Computes mood distributions, sentiment trends, concern levels, and guidance text based on mood history.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient class strings for UI styling.",
  "frontend/src/utils/moodReminder.ts": "Manages once-per-day mood reminder state using localStorage with helpers to check and dismiss it.",
  "frontend/src/utils/shareCode.ts": "Generates a random six‑character alphanumeric share code for onboarding.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets the user’s sound preference in localStorage with a default of enabled.",
  "frontend/src/utils/time.ts": "Provides time conversion between bigint nanoseconds and Date plus utilities for day boundaries and formatting.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, container settings, and plugins for the frontend.",
  "project_state.json": "Holds the project’s versioned state, including high‑level scope notes and a list of existing features with their IDs, descriptions, synonyms, and versions. Used as a structured inventory of current app capabilities for planning."
}