{
  "backend/main.mo": "Defines user-related types including moods, gender, relationship intent, avatars, and profiles, plus helpers for converting variants to text.",
  "feature_evidence.json": "Lists feature evidence records describing two auth-related redirect behaviors and the files implementing them.",
  "frontend-file-summaries.txt": "Contains prewritten short descriptions of various frontend files and their recent behavior changes.",
  "frontend/index.css": "Tailwind base layer defining light and dark theme CSS variables and global styles.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, query client, theming, and global providers for the app.",
  "frontend/src/components/app/AppFooter.tsx": "Empty placeholder file for the app footer component.",
  "frontend/src/components/app/AppHeader.tsx": "Header with theme toggle, journal button, user menu, and logout logic that clears state and redirects to root.",
  "frontend/src/components/app/AppLayout.tsx": "Authenticated layout wrapper that redirects to root when identity becomes undefined and renders header, nav, journal, and content.",
  "frontend/src/components/app/BottomNav.tsx": "Bottom navigation bar with icon-first buttons, active state styling, and unread notification badge support.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Shows a floating button for composing a new entry when visible, navigating to /compose on click.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Provides a button to toggle between light and dark themes using next-themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Blocks children until Internet Identity is initialized and logged in, otherwise shows loading or login panel.",
  "frontend/src/components/auth/LoginPanel.tsx": "Renders the login screen with randomized copy, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays a generated circle energy summary inside a styled card.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Lists circle members with profile details and allows removing members via mutation.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Provides a form to submit a share code to request joining a circle.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Shows pending join requests with profile info and actions to accept or decline.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selection of up to two Safe People with recommendations, profile display, and backend updates.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Card UI for viewing, copying, and editing the user's share code with validation and update mutation.",
  "frontend/src/components/common/IconActionButton.tsx": "Wrapper around a button that adds tooltip support for icon-based actions.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible section component with a trigger button for showing additional content.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Displays a mood check‑in reminder card with dismiss and navigate-to-check‑in actions based on daily rules.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Shows a silent signal entry with author info, mood styling, and timestamp formatting.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Allows sending predefined silent signals to safe people, handling loading state and missing setup.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Popover calendar control for selecting a journal date, preventing future dates.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Manages viewing, creating, and deleting journal entries for a selected date with edit restrictions on past days.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Sheet-based journal overlay combining rules info, date picker, and entries panel with optional reset-to-today.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Displays micro‑action suggestions based on mood history, falling back to guidance when insufficient data is available.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood trends over a selected timeframe and shows patterns, distributions, and micro‑action suggestions.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Allows users to select or upload an avatar, validating files and generating previews while notifying parent components.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates access behind profile loading, error handling, and setup flow, showing setup UI or errors when needed.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides new users through multi‑step profile onboarding, validating input and saving the completed profile.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Monitors notifications, feed updates, join requests, and member changes to play corresponding sound effects on new events.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "UI component for selecting predefined or custom context tags with validation and removal support.",
  "frontend/src/components/status/MoodPicker.tsx": "Searchable mood picker that groups moods by category and highlights the selected one.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Modal prompting users to write a private note and showing optional micro‑action suggestions.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a status post with mood styling, author info, timestamps, and private indicators.",
  "frontend/src/constants/branding.ts": "Exports the app name constant.",
  "frontend/src/constants/contextTags.ts": "Defines predefined context tags and configuration limits for custom tags.",
  "frontend/src/constants/foundationCopy.ts": "Provides core promise and boundary text for the app.",
  "frontend/src/constants/loginCopy.ts": "Contains rotating login screen copy and a helper to pick random phrases.",
  "frontend/src/constants/moods.ts": "Defines all mood options with labels, emojis, and categories used throughout the app.",
  "frontend/src/constants/sounds.ts": "Lists sound asset paths and associated cue types.",
  "frontend/src/constants/systemAvatars.ts": "Defines system avatar metadata and a helper to resolve avatar paths.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Context managing visibility state and controls for the floating journal UI element.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Context for opening and closing the journal overlay with optional reset behavior.",
  "frontend/src/contexts/SoundContext.tsx": "Provides a React context for managing sound effects, handling audio unlocking, and exposing play functions and user sound preferences.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor with additional error handling and refetch capability to detect failed actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity loading via an AuthClient-backed context provider.",
  "frontend/src/hooks/useJournal.ts": "Provides hooks for fetching, creating, updating, and deleting journal entries using the backend actor with React Query.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a user's mood history from feed data within a timeframe, filtering and mapping their status posts.",
  "frontend/src/hooks/useQueries.ts": "Contains numerous profile, feed, avatar, and status query/mutation hooks that interact with the backend actor via React Query.",
  "frontend/src/hooks/useSound.ts": "Simple hook that exposes the SoundContext utilities to components.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes, including color tokens and safe-area padding utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/CirclePage.tsx": "Renders the Circle page with tabs for members, requests, joining by code, and safe people, using feed data to show circle energy.",
  "frontend/src/pages/CirclesImInPage.tsx": "Displays a list of circles the user belongs to, handling loading, error, and empty states with avatar and profile info.",
  "frontend/src/pages/ClosestConnectionsPage.tsx": "Shows ranked closest connections based on overlap and interaction, with loading/error states and expandable explanation sections.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides a form to compose and post a status with mood, audience, and tags, managing selection state and authentication.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Implements the daily check-in flow to post a mood status, enforcing a navigation guard and similar audience/mood logic as compose.",
  "frontend/src/pages/FeedPage.tsx": "Fetches and displays the user's feed with status and silent signal cards, plus reminder logic and refresh controls.",
  "frontend/src/pages/HomeRoutePage.tsx": "Routes users to public home or authenticated feed depending on identity readiness and login state.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Handles invite-code-based authentication flow, triggering login and auto-joining a circle using a stored invite code.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays unread and read notifications, supports navigation to related status pages, and shows loading and empty states.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits the user profile, including avatar, preferences, and visibility settings, with save and cancel flows.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page enabling invite code entry or new account creation, with introductory app information.",
  "frontend/src/pages/StartAuthPage.tsx": "Authentication start page that triggers Internet Identity login and redirects upon success.",
  "frontend/src/pages/StatusDetailPage.tsx": "Fetches and displays a single status post with error handling for missing or unauthorized content.",
  "frontend/src/utils/age.ts": "Provides age calculation, date formatting, and input parsing utilities for birthdate handling.",
  "frontend/src/utils/audience.ts": "Builds a unique Principal audience list for a post, always including the author.",
  "frontend/src/utils/circleEnergy.ts": "Filters recent posts, derives mood-based vibe categories, and generates a weekly Circle Energy summary.",
  "frontend/src/utils/contextTags.ts": "Normalizes and validates custom context tags, enforcing length and duplicate checks.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a one‑time sessionStorage guard flag for entering daily check‑in mode.",
  "frontend/src/utils/inviteCodeSession.ts": "Stores, normalizes, retrieves, and clears invite codes in sessionStorage.",
  "frontend/src/utils/microActions.ts": "Analyzes recent moods and tags to suggest short micro‑actions using a conservative rule engine.",
  "frontend/src/utils/moodAnalysis.ts": "Computes mood distributions, trends, concern levels, and guidance with a non‑clinical disclaimer.",
  "frontend/src/utils/moodColors.ts": "Provides Tailwind class mappings for mood category colors and gradients.",
  "frontend/src/utils/moodReminder.ts": "Controls once‑per‑day mood reminder behavior using localStorage keyed by date.",
  "frontend/src/utils/profileAvatar.ts": "Resolves avatar sources, validates uploads, converts files to bytes, and revokes blob URLs.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric share code without ambiguous characters.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets the user’s sound‑enabled preference in localStorage with a default of true.",
  "frontend/src/utils/time.ts": "Converts backend time formats, checks date ranges, and formats dates for display or input.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, and extended design tokens for the app UI.",
  "project_state.json": "Stores project metadata, architectural notes, and known issues describing current system state and planned evolutions."
}