{
  "backend/main.mo": "Defines user-related types such as Mood, Gender, RelationshipIntent, avatars, and profiles, plus text conversion helpers within an actor canister.",
  "feature_evidence.json": "Lists feature evidence records linking feature IDs to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for various frontend files describing their behavior, UI changes, and routing details.",
  "frontend/index.css": "Tailwind CSS base configuration defining color tokens, dark mode variables, and base element styling.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the router, route tree, theme, React Query client, and global providers for the app.",
  "frontend/src/components/app/AppFooter.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/app/AppHeader.tsx": "Header component with app branding, theme toggle, journal button, and a user dropdown including profile navigation and logout handling.",
  "frontend/src/components/app/AppLayout.tsx": "Authenticated app layout including header, bottom nav, journal overlay, sound manager, and logout-redirect logic.",
  "frontend/src/components/app/BottomNav.tsx": "Renders a fixed bottom navigation bar with icons and unread notification badges, updating active state based on the current route.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Displays a floating action button for composing a new journal entry when visibility context allows.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Provides a button to switch between light and dark themes using next-themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Wraps protected content, showing a loading state or login panel until Internet Identity authentication is ready.",
  "frontend/src/components/auth/LoginPanel.tsx": "Shows a themed login screen with randomized messaging, feature highlights, and a button to start Internet Identity login.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays a summary of circle energy generated from recent posts using a styled card.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Lists circle members with profile details, pulse scores, and controls for removing members.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form for entering and submitting a share code to request joining a circle, with validation and status feedback.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Shows pending join requests with profile info and actions to accept or decline each request.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selection of up to two safe people, showing recommended candidates and handling add/remove actions with backend updates.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Renders a card to view, copy, and edit the user’s share code, including validation and API update flow.",
  "frontend/src/components/common/IconActionButton.tsx": "Button component that displays an icon with a tooltip wrapper and optional children.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible section component with a button trigger to reveal additional content.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Displays a dismissible reminder prompting the user to complete a daily mood check‑in.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Shows a silent signal entry with mood info, author details, and styled coloring based on mood category.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Lets users send predefined silent signals to their Safe People, with setup checks and send feedback.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Date picker popover for selecting journal entry dates, preventing selection of future dates.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Manages viewing, creating, and deleting journal entries for a chosen date with edit restrictions for past days.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Full-screen journal panel containing date selection, rules, and the entries panel, resetting to today when opened.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Generates and displays micro‑action suggestions based on mood history, with a fallback when insufficient data exists. Renders actions, reasons, and disclaimer messaging.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood history over a selectable timeframe, showing trends, top moods, and concern levels. Integrates MicroActionsPanel and UI for timeframe selection and pattern insights.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Allows users to preview, select, or upload an avatar with validation and preview management. Handles system avatars, file uploads, and notifies parent on changes.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates access to profile-dependent content by loading the user profile, handling errors, and triggering onboarding if missing. Shows loading, error recovery, or the wrapped content.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides new users through a multi-step onboarding flow to collect profile details, then saves the completed profile. Includes validation, share code generation, and progressive UI prompts.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Monitors notifications, feed, join requests, and circle members to play sounds when new items appear. Tracks previous data and suppresses sounds on initial load.",
  "frontend/src/components/status/AudienceSelector.tsx": "UI component for choosing the audience of a status post, including whole circle, specific people, safe people, or private, with member selection handling.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Tag picker allowing users to select predefined context tags or add custom ones with validation and soft limits.",
  "frontend/src/components/status/MoodPicker.tsx": "Mood selection component with search, category grouping, and color‑coded mood buttons.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Dialog prompting users to write a private note with optional micro‑action suggestions based on mood history.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a user's status post with mood, author info, timestamps, and privacy indicators.",
  "frontend/src/constants/branding.ts": "Defines the application's brand name constant.",
  "frontend/src/constants/contextTags.ts": "Defines predefined context tags, soft limits, and custom tag length constants.",
  "frontend/src/constants/foundationCopy.ts": "Provides core promise and boundary text for the app’s foundational messaging.",
  "frontend/src/constants/loginCopy.ts": "Contains rotating login screen copy and a helper for selecting random phrases.",
  "frontend/src/constants/moods.ts": "Defines mood options with labels, emojis, and categories for use throughout the app.",
  "frontend/src/constants/sounds.ts": "Maps sound cue identifiers to their asset file paths.",
  "frontend/src/constants/systemAvatars.ts": "Defines a fixed list of system avatar IDs and paths and provides a helper to retrieve an avatar path by ID.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Provides a React context to track and toggle visibility of the floating journal UI.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Implements a context for controlling journal overlay open state and reset behavior.",
  "frontend/src/contexts/SoundContext.tsx": "Manages global sound settings, audio unlocking, and playback functions for notification-related sounds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to expose error state and refetch logic for actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth flow, state, and persistence via a React context provider.",
  "frontend/src/hooks/useJournal.ts": "Provides queries and mutations for journal entries using the backend actor with cache invalidation.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a user's recent mood history from feed data filtered by timeframe and identity.",
  "frontend/src/hooks/useQueries.ts": "Contains profile, avatar, feed, and connection-related React Query hooks backed by the backend actor.",
  "frontend/src/hooks/useSound.ts": "Simple wrapper exposing the SoundContext hook.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive light/dark mode CSS variables plus safe-area padding utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CirclePage.tsx": "Renders the Circle dashboard with energy card, members, join options, requests, and safe people tabs.",
  "frontend/src/pages/CirclesImInPage.tsx": "Shows a list of circles the user is part of, with loading and error states.",
  "frontend/src/pages/ClosestConnectionsPage.tsx": "Displays ranked closest connections with reasons, handling loading and error states.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides a full status composer with mood, content, audience selection, tags, and posting logic.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Implements the daily check‑in flow with mood selection, content, audience controls, and guard enforcement.",
  "frontend/src/pages/FeedPage.tsx": "Fetches and displays the user's feed with status updates, silent signals, reminders, and a composer. Handles loading, empty states, and refresh actions.",
  "frontend/src/pages/HomeRoutePage.tsx": "Routes users to the public home page or the authenticated feed depending on identity state. Shows a loading screen during identity initialization.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Manages invite-code-based authentication flow, including login, editing stored invite codes, and joining a circle. Handles success, errors, and redirects.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays unread and read notifications, supports marking notifications (or all) as read, and links to related statuses. Handles loading and empty states.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits the user's profile, including avatar, preferences, and visibility settings. Supports saving updates, uploading/selecting avatars, and displays pulse score.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page with invite-code entry, onboarding info, and account creation routing. Handles storing invite codes and navigation to authentication.",
  "frontend/src/pages/StartAuthPage.tsx": "Provides login/start-auth screen and redirects authenticated users to the home route. Handles login state, errors, and back navigation.",
  "frontend/src/pages/StatusDetailPage.tsx": "Displays a single status post, handling loading, errors, permission issues, and navigation back to the feed.",
  "frontend/src/utils/age.ts": "Provides helpers to calculate age, format dates for input, and parse date strings into bigint timestamps.",
  "frontend/src/utils/audience.ts": "Builds a unique audience list for a post, ensuring the author is always included.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent status posts to derive sentiment, vibe, and generate abstract circle‑energy summaries.",
  "frontend/src/utils/contextTags.ts": "Normalizes and validates custom context tags, checking length and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a one‑time sessionStorage flag indicating daily check‑in mode entry.",
  "frontend/src/utils/inviteCodeSession.ts": "Stores, normalizes, retrieves, and clears invite codes in sessionStorage.",
  "frontend/src/utils/microActions.ts": "Generates micro‑action suggestions based on recent mood patterns and context tags.",
  "frontend/src/utils/moodAnalysis.ts": "Analyzes mood history to compute distribution, trend, dominant mood, concern level, and guidance.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient class sets for UI styling.",
  "frontend/src/utils/moodReminder.ts": "Handles once‑per‑day mood reminder dismissal using localStorage with date‑based keys.",
  "frontend/src/utils/profileAvatar.ts": "Provides helpers to derive avatar URLs, revoke blob URLs, validate avatar uploads, and convert files to Uint8Array.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric share code using a restricted, non‑ambiguous character set.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets a boolean sound-enabled preference in localStorage with safe fallbacks.",
  "frontend/src/utils/time.ts": "Converts between bigint nanosecond timestamps and Date, offers day-boundary helpers, and formats dates for display or input.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters across query and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, container settings, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes the project’s current architecture, planned membership-model changes, and known issues across frontend and backend."
}