{
  "backend/main.mo": "Defines the main actor with user profile types, mood/gender/intent enums, and text conversion helpers, wiring in authorization and migration logic.",
  "backend/migration.mo": "Provides a migration that adds an optional avatar field to stored user profiles, converting old state into the new format.",
  "feature_evidence.json": "Lists feature evidence mapping avatar‑related features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base/theme variables and dark‑mode tokens defining global color, radius, and layout styles.",
  "frontend/index.html": "HTML entry point containing root mount div and script loader for the frontend app.",
  "frontend/src/App.tsx": "Sets up global providers and TanStack Router routes for all main pages including profile and feed.",
  "frontend/src/components/app/AppFooter.tsx": "Empty placeholder file for a now‑removed footer component.",
  "frontend/src/components/app/AppHeader.tsx": "Renders the top app bar with theme toggle, journal button, user menu, and logout handling.",
  "frontend/src/components/app/AppLayout.tsx": "Defines the global app layout with header, bottom navigation, journal overlay, and main content outlet.",
  "frontend/src/components/app/BottomNav.tsx": "Implements the fixed bottom navigation bar with icon‑first buttons and unread notification badges.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button that appears when visible and navigates to the compose page.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Button that toggles between light and dark themes using next-themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Wraps children with auth logic, showing a loader or login panel if identity is missing.",
  "frontend/src/components/auth/LoginPanel.tsx": "Login screen with branding, randomized copy, Internet Identity login, and error handling.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Card displaying a generated summary of circle energy based on status posts.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Lists circle members with profile info and allows removing other members.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form to submit a share code to join a circle with validation and toast feedback.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Shows incoming join requests with profile info and actions to accept or decline.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Interface to manage up to two safe people, with profile lookup and toggle handling.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "UI card to view, copy, edit, and save a user’s share code with validation and mutation handling.",
  "frontend/src/components/common/IconActionButton.tsx": "Reusable button with icon, tooltip, and optional children using shadcn UI components.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible section with a trigger button for revealing additional content.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Reminder card prompting the user to complete a mood check-in, with dismiss and navigation actions.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Displays a silent signal with author info, mood styling, timestamp, and ownership indicator.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "UI for sending predefined silent signals to safe people, handling validation and async submission.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Popover date picker for selecting a journal date with future dates disabled.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Panel for listing, creating, and deleting journal entries with rules enforcing day-based editability.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Right-side sheet displaying journal UI with date selection, rules, and entries panel.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Displays micro‑action suggestions based on mood history, falling back to guidance when data is insufficient.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood trends over a selected timeframe and visualizes distribution, concerns, and related micro‑actions.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Provides avatar selection and upload with validation, preview handling, and callbacks for updating the user’s avatar.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates profile‑dependent content, handling loading, errors, and showing onboarding if no profile exists.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides new users through multi‑step profile creation and saves the completed profile.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Monitors notifications, feed, join requests, and circle member changes to play appropriate sound effects on new activity.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "UI component for selecting predefined tags and adding custom context tags with validation.",
  "frontend/src/components/status/MoodPicker.tsx": "Searchable mood selector that groups moods by category and lets users pick one.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Dialog prompting users to write a private note and showing optional micro‑action suggestions.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a user’s status post with mood styling, author info, timestamp, and optional audience count.",
  "frontend/src/constants/branding.ts": "Defines the application name constant.",
  "frontend/src/constants/contextTags.ts": "Defines predefined context tags and limits for custom tag usage.",
  "frontend/src/constants/foundationCopy.ts": "Provides core promise and boundary text for the app.",
  "frontend/src/constants/loginCopy.ts": "Contains rotating login screen copy and a helper to select random phrases.",
  "frontend/src/constants/moods.ts": "Defines all mood options with labels, emojis, and categories.",
  "frontend/src/constants/sounds.ts": "Lists sound cue asset paths and their type mapping.",
  "frontend/src/constants/systemAvatars.ts": "Defines system avatar metadata and a helper to get an avatar path by id.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "React context managing visibility of the floating journal UI.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "React context controlling the journal overlay state and open/close behavior.",
  "frontend/src/contexts/SoundContext.tsx": "Provides a sound context that manages audio unlocking, preferences, and playback for notification-related cues.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to add error handling and a refetchable query state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing auth client creation, login, logout, and identity state.",
  "frontend/src/hooks/useJournal.ts": "Provides queries and mutations for fetching, creating, updating, and deleting journal entries through the actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a user's recent mood history from feed items filtered by timeframe and identity.",
  "frontend/src/hooks/useQueries.ts": "Defines various profile, avatar, and data queries and mutations using the backend actor and React Query.",
  "frontend/src/hooks/useSound.ts": "Exposes the sound context hook as a simple wrapper.",
  "frontend/src/index.css": "Tailwind base file defining light/dark theme variables, mood colors, and safe‑area utility rules.",
  "frontend/src/main.tsx": "Application entry point bootstrapping React with QueryClient and Internet Identity providers.",
  "frontend/src/pages/CirclePage.tsx": "Renders the Circle page with tabs for members, requests, joining, and safe people, pulling requests and feed data to show counts and energy posts.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides a form to compose and share a mood status with selected audience, handling mood selection, context tags, and post-submission prompts.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Implements the daily check‑in flow requiring a mood and audience, gated by a reminder guard and ending with an optional journal prompt.",
  "frontend/src/pages/FeedPage.tsx": "Displays the feed of status updates and silent signals, with refresh, mood reminder, and empty‑state guidance.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows unread and read notifications with timestamps, allowing users to mark items as read and navigate to related statuses.",
  "frontend/src/pages/ProfilePage.tsx": "Lets users view and edit their profile, including personal info, preferences, and avatar management.",
  "frontend/src/pages/StatusDetailPage.tsx": "Displays a single status post with loading and error handling, allowing navigation back to the feed.",
  "frontend/src/utils/age.ts": "Utilities for calculating age, formatting dates, and parsing date strings using bigint timestamps.",
  "frontend/src/utils/circleEnergy.ts": "Provides mood filtering, sentiment categorization, vibe analysis, and seeded phrase generation for Circle Energy summaries.",
  "frontend/src/utils/contextTags.ts": "Validates and normalizes custom context tags, checking for emptiness, length, and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a sessionStorage guard flag for entering daily check‑in mode once per session.",
  "frontend/src/utils/microActions.ts": "Generates micro‑action suggestions based on recent mood patterns and context tags using a conservative rule engine.",
  "frontend/src/utils/moodAnalysis.ts": "Analyzes mood patterns to compute distributions, trends, concern levels, and user guidance with a disclaimer.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient class sets for consistent UI styling.",
  "frontend/src/utils/moodReminder.ts": "Manages a once‑per‑day mood reminder using localStorage to track dismissal by date.",
  "frontend/src/utils/profileAvatar.ts": "Builds avatar image sources from system or uploaded data and validates avatar uploads.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric onboarding share code without ambiguous characters.",
  "frontend/src/utils/soundPreferences.ts": "Stores and retrieves the user's sound‑enabled preference using localStorage with safe defaults.",
  "frontend/src/utils/time.ts": "Utilities for converting between bigint nanosecond timestamps and JS Dates, checking day boundaries, and formatting dates for display or input.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters (including hash-based routing), persisting them in sessionStorage, and managing stored parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, radius, shadows, and enabling plugins like typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current feature set, scope direction, and versions for app routing, authentication, onboarding, actors, RBAC, and query hooks."
}