{
  "backend/main.mo": "Defines a large Mood variant with text conversion plus supporting types and an actor skeleton for profile, status, and authorization logic.",
  "backend/migration.mo": "Contains old-to-new data model definitions and structures used for migrating mood enums and stored actor state to the updated schema.",
  "feature_evidence.json": "Feature evidence report documenting required frontend mood catalog updates and the affected files and components.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for numerous frontend files describing recent UI, routing, and interaction changes.",
  "frontend/index.css": "Tailwind base file defining color variables, themes, and global styles for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React application and loads main.tsx.",
  "frontend/index.ts": "Empty placeholder TypeScript file with no implementation.",
  "frontend/src/App.tsx": "Sets up React Query, theming, sound context, and the full TanStack Router route tree for public and authenticated app pages.",
  "frontend/src/components/app/AppFooter.tsx": "Empty component file with no implementation.",
  "frontend/src/components/app/AppHeader.tsx": "Header component showing app title, journal button, theme toggle, and a user menu with profile and logout actions.",
  "frontend/src/components/app/AppLayout.tsx": "Defines the main app layout with header, bottom nav, journal overlays, and redirects on logout.",
  "frontend/src/components/app/BottomNav.tsx": "Renders a bottom navigation bar with icons and unread notification badges.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Shows a floating action button for creating a new journal entry when visible.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Button that toggles between light and dark themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Wraps children with auth loading and login handling, showing login if user is unauthenticated.",
  "frontend/src/components/auth/LoginPanel.tsx": "Displays the login UI with branding, randomized copy, and login action handling.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Shows a generated summary of circle energy based on recent posts.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Lists circle members with profiles, pulse scores, and remove-member actions.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form for joining a circle using a share code with validation and mutation handling.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Displays pending join requests with accept and decline actions and profile details.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selecting up to two Safe People, showing candidates and recommendations, and handling add/remove actions with backend updates.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Displays and edits the user’s share code with copy, edit, and save actions tied to backend updates.",
  "frontend/src/components/common/IconActionButton.tsx": "Reusable button that shows an icon with a tooltip, wrapping the standard Button component.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible UI component that reveals hidden content when triggered.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Shows a dismissible daily mood check‑in reminder card that navigates users to the check‑in page.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Displays a silent signal with author info, timestamp, and mood styling, indicating if it’s the user’s own signal.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Lets users send predefined silent signals to their Safe People, handling send states and setup requirements.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Date picker for journal entries using a popover calendar, preventing selection of future dates.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Shows journal entries for a selected date with create, delete, and read‑only rules based on date context.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Displays a right-side sheet for journaling with date selection, rules disclosure, and entries panel, resetting to today when opened if requested.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Generates and displays micro‑action suggestions based on mood history, falling back to guidance if insufficient data.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood history over a selected timeframe, showing trends, distributions, and top moods, and includes micro‑actions.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Lets users preview, select, or upload avatars with validation, updating the parent on changes and managing preview URLs.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates profile-dependent content, handling loading, errors, setup flow, retry, and logout.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Step‑based onboarding dialog collecting user profile details and saving them on completion.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Plays sounds when new notifications, feed items, join requests, or circle members appear, ignoring initial loads.",
  "frontend/src/components/status/AudienceSelector.tsx": "UI component for choosing post audience and optionally selecting specific circle members, excluding the current user.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Lets users add predefined or custom context tags with validation and soft limits.",
  "frontend/src/components/status/MoodPicker.tsx": "Searchable mood selector that groups moods by category and highlights the selected mood.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Modal prompting users to add a private note with optional micro‑action suggestions.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a mood status post with author info, mood styling, timestamp, and optional privacy indicators.",
  "frontend/src/constants/branding.ts": "Defines the app name constant.",
  "frontend/src/constants/contextTags.ts": "Provides predefined context tags and limits for custom tag creation.",
  "frontend/src/constants/foundationCopy.ts": "Contains core app promise and boundary text for UI messaging.",
  "frontend/src/constants/loginCopy.ts": "Holds rotating login screen text and a function to pick random phrases.",
  "frontend/src/constants/moods.ts": "Defines all mood options with labels, emojis, and categories.",
  "frontend/src/constants/sounds.ts": "Lists sound asset paths and the sound cue type.",
  "frontend/src/constants/systemAvatars.ts": "Defines a fixed list of system avatar IDs and asset paths plus a helper to look up an avatar path by ID.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Provides a React context for showing or hiding the floating journal UI with simple visibility controls.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Implements a context controlling the journal overlay state, including opening with optional reset and closing.",
  "frontend/src/contexts/SoundContext.tsx": "Manages global sound settings, initializes audio assets, unlocks audio on interaction, and exposes sound‑playing functions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to add error tracking and a refetch mechanism for actor initialization failures.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions via Internet Identity, including login, logout, and identity loading.",
  "frontend/src/hooks/useJournal.ts": "Provides queries and mutations for fetching, creating, updating, and deleting journal entries through the backend actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a user's recent mood history from feed items filtered by timeframe, author, and type.",
  "frontend/src/hooks/useQueries.ts": "Defines profile, avatar, feed, connection, and other backend queries and mutations using the actor.",
  "frontend/src/hooks/useSound.ts": "Re-exports the sound context hook for convenient access to sound controls.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables plus safe‑area padding utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/CirclePage.tsx": "Renders the main Circle page with tabs for members, requests, joining, and safe people plus circle energy data.",
  "frontend/src/pages/CirclesImInPage.tsx": "Shows a list of circle owners the user belongs to, handling loading and error states.",
  "frontend/src/pages/ClosestConnectionsPage.tsx": "Displays ranked closest connections with avatars and optional explanation via progressive disclosure.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Form for composing a status with mood, tags, audience selection, and posting logic.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Daily check‑in flow to post a mood/status with audience controls, guard checks, and mood history integration.",
  "frontend/src/pages/FeedPage.tsx": "Displays the user feed with refresh, reminder, composer, and dynamic rendering of status or silent-signal items.",
  "frontend/src/pages/HomeRoutePage.tsx": "Routes users to public or authenticated home views depending on identity initialization and login state.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Handles invite-code-based login flow, storing codes, triggering authentication, and joining circles after login.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows unread/read notifications with ability to mark items or all as read and navigate to linked statuses.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits user profile details, avatar, preferences, and pulse score with save and cancel flows.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page allowing invite code entry or account creation with informational sections.",
  "frontend/src/pages/StartAuthPage.tsx": "Simple login/create-account start page that redirects on successful authentication.",
  "frontend/src/pages/StatusDetailPage.tsx": "Displays a single status with loading/error states, permission handling, and navigation back to the feed.",
  "frontend/src/utils/age.ts": "Provides helpers to calculate age, format dates for input, and parse date strings into bigint timestamps.",
  "frontend/src/utils/audience.ts": "Builds a unique audience list for a post, ensuring the author is always included.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent posts to classify circle mood/vibe and generate non-clinical summary text using stable seeded phrase selection.",
  "frontend/src/utils/contextTags.ts": "Normalizes and validates custom context tags, checking length, emptiness, and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a sessionStorage flag indicating one-time entry into daily check‑in mode.",
  "frontend/src/utils/inviteCodeSession.ts": "Stores, retrieves, normalizes, and clears invite codes in sessionStorage.",
  "frontend/src/utils/microActions.ts": "Generates micro‑action suggestions based on recent mood patterns and context tags using a conservative ruleset.",
  "frontend/src/utils/moodAnalysis.ts": "Analyzes mood history to compute distribution, trends, concern level, and guidance with a built‑in disclaimer.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient class sets for consistent UI styling.",
  "frontend/src/utils/moodReminder.ts": "Handles once‑per‑day mood reminder visibility using localStorage keyed by local date.",
  "frontend/src/utils/profileAvatar.ts": "Utilities for deriving avatar image URLs, validating avatar files, converting uploads to bytes, and revoking blob URLs.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric share code using a reduced, unambiguous character set.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets a boolean sound‑enabled preference in localStorage with safe fallbacks.",
  "frontend/src/utils/time.ts": "Helpers for converting between bigint nanosecond timestamps and Date, checking date ranges, and formatting dates.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash), persisting them in sessionStorage, and clearing stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, shadows, and enabling plugins like typography, container queries, and animations.",
  "project_state.json": "Project state metadata including high‑level summary, architectural notes, and known issues for the CloseCircle app."
}