{
  "backend/main.mo": "Defines user profile, mood, gender, and relationship intent types with text converters inside an actor canister.",
  "feature_evidence.json": "Lists feature requirements, associated files, components, and test IDs for copy, mood analysis, and UI behavior changes.",
  "frontend-file-summaries.txt": "Contains human‑written summaries of frontend files for quick reference during build planning.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global styling.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, theme provider, and global app structure with AuthGate and ProfileGate.",
  "frontend/src/components/app/AppHeader.tsx": "Renders the sticky app header with branding, journal button, and user menu including profile and logout options.",
  "frontend/src/components/app/AppLayout.tsx": "Wraps the main app layout with header, bottom nav, outlet content, and journal overlay providers.",
  "frontend/src/components/app/BottomNav.tsx": "Displays a fixed bottom navigation bar with active state detection and unread notification badges.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button that opens the compose page when visible based on journal visibility context.",
  "frontend/src/components/auth/AuthGate.tsx": "Wraps children with authentication, showing a loading screen or login panel when needed.",
  "frontend/src/components/auth/LoginPanel.tsx": "Renders the login UI with random copy, status messages, and a button to trigger Internet Identity login.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Displays a generated summary of circle energy based on provided status posts.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Shows current circle members with profile info and allows removing members.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form to join a circle by entering a share code and sending a join request.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Lists incoming join requests with profile info and actions to accept or decline.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Displays and allows editing or copying the user's share code.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Shows a reminder card prompting the user to log a mood, with dismiss and navigation actions.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Button-triggered popover calendar for selecting a journal entry date.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Displays journal entries for a selected date with support for adding, saving, and deleting entries when editing is allowed.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Wraps the journal UI in a slide-in panel with date selection and an entries panel.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes historical mood data, shows trends, distribution, and top moods over a selected timeframe.",
  "frontend/src/components/profile/ProfileGate.tsx": "Blocks app access until the user profile is loaded and triggers onboarding if no profile exists.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides users through multi-step profile creation and saves the completed profile.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Lets users select predefined or custom context tags with validation and soft limits.",
  "frontend/src/components/status/MoodPicker.tsx": "Provides searchable, categorized mood options and returns the selected mood.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Shows a prompt asking whether the user wants to write a private journal note after posting a status.",
  "frontend/src/components/status/StatusCard.tsx": "Renders a status card showing author info, mood details, content, and audience count with identity-based badges.",
  "frontend/src/constants/branding.ts": "Defines the app name constant.",
  "frontend/src/constants/contextTags.ts": "Provides predefined context tags plus configuration limits for tagging.",
  "frontend/src/constants/foundationCopy.ts": "Exports the core promise and boundary text defining the app’s purpose and limits.",
  "frontend/src/constants/loginCopy.ts": "Contains rotating emotional login screen phrases and a helper to pick a random one.",
  "frontend/src/constants/moods.ts": "Defines all mood options with labels, emojis, and categories for mood selection.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Context for controlling visibility of a floating journal component with show/hide methods.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Context managing journal overlay state, including open/close and reset behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and methods using Internet Identity, managing login, identity loading, and errors.",
  "frontend/src/hooks/useJournal.ts": "Hooks for querying, creating, updating, and deleting journal entries via the backend actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a user's mood history from feed data within a timeframe, returning sorted mood entries.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for profiles, share codes, join requests, circle data, statuses, and notifications using an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes with safe‑area utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/CirclePage.tsx": "Renders the circle dashboard with energy, members, join requests, and share code management tabs.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Page for composing and submitting a status update with mood, audience, and context tags.",
  "frontend/src/pages/FeedPage.tsx": "Displays the user's feed with status cards, refresh controls, and mood reminder logic.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows unread and read notifications with marking‑as‑read and navigation to related status updates.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editor page that loads the caller's profile, supports editing fields, and saves updates via mutation hooks with validation and UI state handling.",
  "frontend/src/pages/StatusDetailPage.tsx": "Displays a single status post with loading/error handling and navigation back to the feed.",
  "frontend/src/utils/age.ts": "Utility functions for calculating age, formatting DOB for inputs, and parsing date strings into bigint timestamps.",
  "frontend/src/utils/circleEnergy.ts": "Generates a soft sentiment summary for recent status posts by filtering recent posts, categorizing moods, determining vibe, and selecting seeded phrases.",
  "frontend/src/utils/contextTags.ts": "Validates and normalizes custom context tags, checking length, emptiness, and duplicates.",
  "frontend/src/utils/moodAnalysis.ts": "Analyzes mood patterns to compute distributions, dominant mood, trends, concern level, and guidance with a safety disclaimer.",
  "frontend/src/utils/moodReminder.ts": "Manages once-per-day mood reminder visibility using localStorage keyed by local date.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character alphanumeric share code using a restricted, user-friendly character set.",
  "frontend/src/utils/time.ts": "Time utilities for converting between bigint timestamps and Date, checking date boundaries, and formatting dates.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL params (including hash routing), storing them in sessionStorage, and clearing or persisting them.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Metadata describing the project’s version, overall app summary, and a list of existing implemented features with IDs and descriptions."
}