{
  "backend/main.mo": "Motoko canister defining core domain types (Mood, Gender, RelationshipIntent, UserProfile, etc.) with text conversion helpers, user profile data structures, and authorization imports for a social/emotional app backend.",
  "feature_evidence.json": "Machine-readable report listing implemented frontend features, affected files, dependent components, test IDs, and confidence levels for UI text and branding changes.",
  "frontend-file-summaries.txt": "JSON-style map providing concise descriptions of major frontend React components, pages, and UI elements to aid understanding and planning.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles for the application UI.",
  "frontend/index.html": "HTML entry point setting metadata, page title, root mount node, and loading the React application bundle.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes, authentication/profile gates, theme provider, and global toaster notifications.",
  "frontend/src/components/app/AppHeader.tsx": "Sticky top header showing CloseCircle branding and a user dropdown with profile, journal, and sign-out actions.",
  "frontend/src/components/app/AppLayout.tsx": "Main layout wrapper combining header, routed content outlet, bottom navigation, floating journal controls, and journal overlay state.",
  "frontend/src/components/app/BottomNav.tsx": "Fixed bottom navigation bar with route buttons for feed, circle, compose, and notifications, including unread badge counts.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button that conditionally appears to navigate users to the compose/journal page.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that shows a loading spinner during identity initialization, renders the login panel if unauthenticated, or children when logged in.",
  "frontend/src/components/auth/LoginPanel.tsx": "Renders the login screen using Internet Identity, showing branding, security highlights, and a login button with loading and error states.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Displays the current user's circle members with profile details, supports removing members, and handles loading and empty states.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Provides a form to join a circle by entering a share code, normalizing input and sending a join request with success/error feedback.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Lists pending join requests to the user's circle, showing requester profiles and allowing accept or decline actions.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Shows the user's current share code with copy functionality and allows editing/updating the code with validation and warnings.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "A popover-based date picker for selecting a journal date, disabling future dates and formatting the selected date.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Displays, creates, and deletes journal entries for a selected date, allowing edits only for today and read-only viewing for past dates.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Implements a side-sheet overlay that hosts the journal UI, managing selected date state and composing the date picker and entries panel.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Renders a card that analyzes a user's mood history over a selectable timeframe, showing trends, concern levels, and top moods using derived statistics.",
  "frontend/src/components/profile/ProfileGate.tsx": "Guards child content by loading the current user's profile and conditionally showing a profile setup dialog or a loading screen.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Implements a multi-step onboarding dialog to collect and save a user's profile information, including name, demographics, preferences, and a generated share code.",
  "frontend/src/components/status/MoodPicker.tsx": "Provides a searchable, categorized grid UI for selecting a mood from predefined mood options.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a single status post with author info, mood emoji/label, optional content, timestamp, and audience details.",
  "frontend/src/constants/branding.ts": "Defines application-level branding constants such as the app name.",
  "frontend/src/constants/moods.ts": "Defines the MoodOption interface and a categorized catalog of all supported moods with labels and emojis.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Provides a React context and hook to control the visibility state of a floating journal UI component.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, handling anonymous access, admin initialization, and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context, provider, and hook to manage Internet Identity authentication, including login/logout, persisted identity loading, and detailed login status flags.",
  "frontend/src/hooks/useJournal.ts": "Provides React Query hooks to fetch, create/update, and delete journal entries via a backend actor, with date-based filtering and cache invalidation.",
  "frontend/src/hooks/useMoodHistory.ts": "Computes a chronological mood history for the current user by filtering feed posts within a timeframe and mapping them to mood/date entries.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend actors, covering user profiles, join requests, feed/status data, mutations, and cache management.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark theme color variables, base styles, typography, and safe-area utilities for responsive layouts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider and imports global styles.",
  "frontend/src/pages/CirclePage.tsx": "Circle management page with tabbed UI for viewing members, handling join requests, sharing invite codes, and joining a circle.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Form page for composing and posting a mood status, including mood selection, optional text, audience selection, and submission handling.",
  "frontend/src/pages/FeedPage.tsx": "Displays the user’s feed of status updates with loading/empty states, manual refresh, and navigation to compose a new status.",
  "frontend/src/pages/NotificationsPage.tsx": "Renders a notifications inbox that fetches, groups, and displays read/unread notifications, marks them as read on click, and navigates to related status details. Handles loading, empty states, and shows a placeholder alert for upcoming push notifications.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the current user's profile, including personal details, preferences, and relationship intent, with form validation and save/cancel flows. Integrates profile update APIs, toast feedback, and hides a floating journal UI while editing.",
  "frontend/src/pages/StatusDetailPage.tsx": "Fetches and displays a single status by ID with loading and error handling. Provides navigation back to the main feed and renders the status via a reusable StatusCard component.",
  "frontend/src/utils/age.ts": "Provides helpers to calculate age from a birthdate bigint, format birthdates for input fields, and parse date input strings back to bigint timestamps. Includes validation for invalid or future dates.",
  "frontend/src/utils/moodAnalysis.ts": "Analyzes mood entries to compute distributions, dominant mood, trends, concern levels, and user guidance with a safety disclaimer. Classifies moods by sentiment and applies conservative thresholds for mental health insights.",
  "frontend/src/utils/shareCode.ts": "Generates a random, user-friendly 6-character alphanumeric share code, excluding visually ambiguous characters. Intended for onboarding or sharing flows.",
  "frontend/src/utils/time.ts": "Utility functions for converting between backend nanosecond timestamps and JavaScript Dates, plus helpers for day boundaries and date comparisons. Also includes formatting helpers for display and input fields.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash routing, persisting them in sessionStorage, and clearing them when needed. Supports maintaining sensitive or session-scoped parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container layout, and extensive theme extensions for colors (using CSS variables/OKLCH), typography, radius, shadows, fonts, and animations, with several Tailwind plugins enabled.",
  "project_state.json": "Project metadata and evolving state document describing the vision, scope, and implemented features of a private close-circle social/mood app, including authentication, profiles, invite codes, circle management, status updates, and in-app notifications."
}