{
  "backend/main.mo": "Defines user-related types including moods, genders, relationship intents, avatars, and conversion helpers within the main actor.",
  "backend/migration.mo": "Migration module initializing a new directedInteractions map structure for the updated actor state.",
  "feature_evidence.json": "Feature evidence report describing a frontend requirement tied to interaction count display and listing affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files covering routing, UI components, pages, and behavior changes.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling rules.",
  "frontend/index.html": "Base HTML document bootstrapping the frontend app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root application setup configuring TanStack Router routes, React Query, theming, and global providers.",
  "frontend/src/components/app/AppFooter.tsx": "Empty footer component placeholder.",
  "frontend/src/components/app/AppHeader.tsx": "Header with app branding, theme toggle, journal button, and user menu including logout and profile actions.",
  "frontend/src/components/app/AppLayout.tsx": "Authenticated layout wrapper handling logout redirection and rendering header, bottom nav, journal overlay, and main content.",
  "frontend/src/components/app/BottomNav.tsx": "Bottom navigation bar with icon-first buttons and unread notification badges tied to query data.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button for composing a new mood entry, shown conditionally based on journal visibility.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Provides a button that toggles between light and dark themes using next-themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Wraps children with authentication logic, showing a loading spinner or login panel if needed.",
  "frontend/src/components/auth/LoginPanel.tsx": "Displays the login UI with randomized copy and handles Internet Identity authentication attempts.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Generates and displays a summary of circle energy based on status posts.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Shows circle members with profiles, pulse scores, and removal actions.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form for entering a share code to request joining a circle with validation and status feedback.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Displays pending join requests with profile details and actions to accept or decline.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selection of up to two Safe People from eligible candidates with recommendations and toggle handling.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "UI card for viewing, copying, and editing a user's share code with validation and mutation handling.",
  "frontend/src/components/common/IconActionButton.tsx": "Wrapper around a button that adds an icon and tooltip support.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible section component with a trigger button and optional default-open behavior.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Displays a daily mood check-in reminder with actions to check in or dismiss.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Renders a silent signal entry showing author info, mood, timestamp, and styling based on mood.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Lets users send predefined silent signals to Safe People, handling loading and setup checks.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Popover-based date picker for selecting journal entry dates with future-date disabling.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Shows journal entries for a selected date with creation, deletion, and edit rules based on date.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Right-side sheet that hosts the journal UI, including rules, date picker, and entries panel.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Shows micro‑action suggestions based on mood history, with a fallback when insufficient data and a disclaimer alert.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Analyzes mood trends over a selected timeframe and displays insights, top moods, concern levels, and micro‑actions.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Provides UI for selecting or uploading a profile avatar with validation, previews, and callback updates.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates app content by loading user profile, handling errors, and triggering profile setup when needed.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Multi‑step onboarding form collecting profile details and saving them after validation.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Watches notifications, feed, join requests, and circle members to play sounds when new activity appears.",
  "frontend/src/components/status/AudienceSelector.tsx": "UI component for choosing audience visibility and optionally selecting specific circle members, excluding the current user.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "Provides predefined and custom context tag selection with validation and tag management UI.",
  "frontend/src/components/status/MoodPicker.tsx": "Searchable, categorized mood selector rendering emoji-based mood buttons and grouping results.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Modal prompting users to add a private note with optional micro‑action suggestions based on mood history.",
  "frontend/src/components/status/StatusCard.tsx": "Displays a user's status post with mood styling, author info, timestamps, and private indicators.",
  "frontend/src/constants/branding.ts": "Defines the app name constant.",
  "frontend/src/constants/contextTags.ts": "Defines predefined context tags, soft limits, and max custom tag length.",
  "frontend/src/constants/foundationCopy.ts": "Contains short core messaging phrases outlining the app's promise and boundaries.",
  "frontend/src/constants/loginCopy.ts": "Provides rotating login screen phrases and a helper to pick random ones.",
  "frontend/src/constants/moods.ts": "Defines all mood options with labels, emojis, and categories for mood selection components.",
  "frontend/src/constants/sounds.ts": "Exports paths for UI sound assets and a type for sound cue keys.",
  "frontend/src/constants/systemAvatars.ts": "Defines a fixed list of system avatar IDs and paths and provides a helper to look up an avatar path by ID.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Provides React context to track and toggle visibility of a floating journal component.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Manages open state and reset behavior for a journal overlay, exposing open and close controls via context.",
  "frontend/src/contexts/SoundContext.tsx": "Implements global sound settings, audio unlocking, and playback functions for notification-related sound cues.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to add error reporting and refetch capabilities for actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity login, state management, and persistence via a React context provider.",
  "frontend/src/hooks/useJournal.ts": "Provides queries and mutations for fetching, creating, updating, and deleting journal entries through the actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds filtered and sorted mood history from the user’s feed posts within a given timeframe.",
  "frontend/src/hooks/useQueries.ts": "Supplies profile, feed, avatar, and various backend data queries and mutations using the actor and React Query.",
  "frontend/src/hooks/useSound.ts": "A thin wrapper exposing the sound context hook.",
  "frontend/src/index.css": "Defines global Tailwind layers and extensive CSS variables for light/dark themes, mood colors, and safe-area padding utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/CirclePage.tsx": "Renders the main Circle page with energy card, member lists, join/request panels, and tab-based navigation.",
  "frontend/src/pages/CirclesImInPage.tsx": "Displays circles the user is part of, handling loading, error states, and listing owners with avatars.",
  "frontend/src/pages/ClosestConnectionsPage.tsx": "Shows ranked closest connections with avatars and explanations, including loading and error handling.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Provides a full UI for composing a status with mood, text, audience selection, and context tags.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Implements the daily check‑in flow with mood selection, audience controls, guard checks, and status posting.",
  "frontend/src/pages/FeedPage.tsx": "Displays the main feed with status updates, silent signals, reminders, and refresh capabilities.",
  "frontend/src/pages/HomeRoutePage.tsx": "Routes users to public home, feed, or loading state based on authentication and profile readiness.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Handles invite-code–based onboarding, login flow, and joining a circle using a stored invite code.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows unread and read notifications with support for marking items or all as read and navigating to related statuses.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile viewing and editing, including avatar selection, preferences, and pulse score display.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page that explains the app and lets users enter an invite code or start account creation.",
  "frontend/src/pages/StartAuthPage.tsx": "Authentication entry page allowing users to log in or create an account and routing them after login.",
  "frontend/src/pages/StatusDetailPage.tsx": "Displays a single status by ID with loading, error, and permission handling, and links back to the feed.",
  "frontend/src/utils/age.ts": "Provides utilities to calculate age, format dates for input, and parse input dates into bigint timestamps.",
  "frontend/src/utils/audience.ts": "Builds a status post audience list ensuring the author is always included and removes duplicates using Principals.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent posts to categorize circle vibe, generate seeded summaries, and filter out banned terms.",
  "frontend/src/utils/contextTags.ts": "Normalizes and validates custom context tags, enforcing length limits and preventing duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Implements a sessionStorage flag to enter daily check-in mode once and consume it on use.",
  "frontend/src/utils/inviteCodeSession.ts": "Manages normalized invite codes in sessionStorage, supporting store, retrieve, and clear operations.",
  "frontend/src/utils/microActions.ts": "Generates micro‑action suggestions based on recent mood patterns and context tags using a conservative rule engine.",
  "frontend/src/utils/moodAnalysis.ts": "Computes mood distributions, trends, concern levels, and guidance with a built‑in disclaimer.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient classes for consistent UI styling.",
  "frontend/src/utils/moodReminder.ts": "Handles once‑per‑day mood reminder logic using localStorage to track dismissal per local date.",
  "frontend/src/utils/profileAvatar.ts": "Utilities to derive avatar image sources, validate avatar uploads, convert files to bytes, and revoke blob URLs.",
  "frontend/src/utils/shareCode.ts": "Generates a six‑character, unambiguous alphanumeric share code for onboarding.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets a boolean sound‑enabled preference in localStorage with safe fallbacks.",
  "frontend/src/utils/time.ts": "Helpers for converting between bigint nanosecond timestamps and Date objects, comparing dates, and formatting them.",
  "frontend/src/utils/urlParams.ts": "Functions for reading URL parameters (including hash), persisting them in sessionStorage, and managing stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, shadows, and enabling typography, container queries, and animations.",
  "project_state.json": "Project metadata summarizing current architecture, planned membership model changes, and known issues across frontend and backend."
}