{
  "backend/main.mo": "Defines a Motoko actor with extensive Mood and Gender variants and helpers, laying groundwork for user mood handling and text conversion.",
  "feature_evidence.json": "Feature-evidence report listing a UI change to hide relationship intent in the Circle Members list and its affected file.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing recent UI, routing, and logic changes across the app.",
  "frontend/index.css": "Tailwind CSS base setup defining light/dark theme variables and global background/foreground styling.",
  "frontend/index.html": "HTML entrypoint injecting the root div and loading the main TypeScript bundle.",
  "frontend/index.ts": "Empty placeholder TypeScript file.",
  "frontend/src/App.tsx": "Configures TanStack Router, React Query, theming, and authenticated/public route trees for the entire React app.",
  "frontend/src/components/app/AppFooter.tsx": "Empty footer component file.",
  "frontend/src/components/app/AppHeader.tsx": "App header with theme toggle, journal button, user menu, and logout behavior that clears identity and cache.",
  "frontend/src/components/app/AppLayout.tsx": "Authenticated app layout wrapping header, bottom nav, journal overlay, and logout-redirect logic.",
  "frontend/src/components/app/BottomNav.tsx": "Bottom navigation bar with icon-first buttons and unread notification badges using safe-area padding.",
  "frontend/src/components/app/FloatingJournalFab.tsx": "Floating action button that opens the compose page when visible.",
  "frontend/src/components/app/ThemeToggleButton.tsx": "Toggle button switching between light and dark modes using next-themes.",
  "frontend/src/components/auth/AuthGate.tsx": "Wraps children with an auth check, showing a loading screen or login panel until Internet Identity is ready.",
  "frontend/src/components/auth/LoginPanel.tsx": "Displays the login UI with randomized copy, error handling, and Internet Identity login triggers.",
  "frontend/src/components/circle/CircleEnergyCard.tsx": "Generates and displays a summary of circle activity using provided posts.",
  "frontend/src/components/circle/CircleMembersList.tsx": "Shows circle members with profile data, pulse scores, and controls for removing members.",
  "frontend/src/components/circle/JoinByCodeForm.tsx": "Form to submit a share code for joining a circle, with validation and mutation handling.",
  "frontend/src/components/circle/PendingRequestsPanel.tsx": "Lists incoming join requests with profile details and allows accepting or declining them.",
  "frontend/src/components/circle/SafePeoplePanel.tsx": "Manages selection of up to two safe people, including recommendations and toggle logic.",
  "frontend/src/components/circle/ShareCodeCard.tsx": "Displays and allows editing of the user's share code, including copy and update actions.",
  "frontend/src/components/common/IconActionButton.tsx": "Wrapper around a Button that shows an icon and label with a tooltip, forwarding refs and props.",
  "frontend/src/components/common/ProgressiveDisclosure.tsx": "Collapsible section component with a button trigger and animated chevron for expanding content.",
  "frontend/src/components/feed/MoodCheckInReminderCard.tsx": "Displays a reminder card prompting users to complete a mood check-in, with dismiss and navigate actions.",
  "frontend/src/components/feed/SilentSignalCard.tsx": "Renders a silent signal post with mood styling, author info, and timestamp, indicating if it’s the user's own.",
  "frontend/src/components/feed/SilentSignalComposerCard.tsx": "Allows users to send predefined silent signals to safe people, handling setup checks and async submission.",
  "frontend/src/components/journal/JournalDatePicker.tsx": "Popover calendar control for selecting a journal date, preventing future dates.",
  "frontend/src/components/journal/JournalEntriesPanel.tsx": "Manages viewing, creating, and deleting journal entries for a selected date with editable‑today rules.",
  "frontend/src/components/journal/JournalOverlay.tsx": "Right‑side sheet showing journal UI with rules, date picker, and entries panel.",
  "frontend/src/components/profile/MicroActionsPanel.tsx": "Generates and displays micro‑action suggestions based on mood history, with fallback when data is insufficient.",
  "frontend/src/components/profile/MoodAnalyzerCard.tsx": "Displays mood pattern analysis over a selectable timeframe, showing trends, top moods, concern levels, and micro‑actions.",
  "frontend/src/components/profile/ProfileAvatarEditor.tsx": "Provides avatar selection and upload functionality with validation, preview handling, and system avatar support.",
  "frontend/src/components/profile/ProfileGate.tsx": "Gates app content based on profile load status, showing setup, errors, or children depending on query results.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Guides new users through a multi‑step onboarding flow to create and save their profile.",
  "frontend/src/components/sound/SoundEffectsManager.tsx": "Listens for new notifications, feed items, join requests, and circle member changes to trigger sound effects.",
  "frontend/src/components/status/AudienceSelector.tsx": "Lets users choose who can see a post, including circle-wide, specific people, safe people, or private options.",
  "frontend/src/components/status/ContextTagsPicker.tsx": "UI component for selecting predefined or custom context tags with validation and soft limits.",
  "frontend/src/components/status/MoodPicker.tsx": "Mood selection UI with search, category grouping, and emoji-based mood buttons.",
  "frontend/src/components/status/PostStatusPrivateNotePrompt.tsx": "Dialog prompting users to write a private note and showing optional micro‑action suggestions.",
  "frontend/src/components/status/StatusCard.tsx": "Renders a user's mood status card with author info, mood styling, timestamp, and privacy indicators.",
  "frontend/src/constants/branding.ts": "Defines the app name constant.",
  "frontend/src/constants/contextTags.ts": "Lists predefined context tags and configuration limits for custom tags.",
  "frontend/src/constants/foundationCopy.ts": "Provides core app promise and boundary text.",
  "frontend/src/constants/loginCopy.ts": "Contains login screen text variants and a helper for random phrase selection.",
  "frontend/src/constants/moods.ts": "Defines mood options with labels, emojis, and categories used across mood‑related UI.",
  "frontend/src/constants/sounds.ts": "Defines paths for notification and activity sound assets.",
  "frontend/src/constants/systemAvatars.ts": "Lists system avatar metadata and provides lookup by ID.",
  "frontend/src/contexts/FloatingJournalVisibilityContext.tsx": "Context controlling visibility of the floating journal UI.",
  "frontend/src/contexts/JournalOverlayControllerContext.tsx": "Context managing the open state and reset behavior of the journal overlay.",
  "frontend/src/contexts/SoundContext.tsx": "Provides global sound settings and playback utilities, handling audio unlocking and user preferences.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to expose error state and refetch behavior for actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login/logout flow, and provides identity via context.",
  "frontend/src/hooks/useJournal.ts": "Provides hooks to query, create/update, and delete journal entries via the backend actor.",
  "frontend/src/hooks/useMoodHistory.ts": "Builds a filtered, chronological mood history for the current user based on recent feed items.",
  "frontend/src/hooks/useQueries.ts": "Contains profile, avatar, feed, and notification query/mutation hooks backed by the backend actor.",
  "frontend/src/hooks/useSound.ts": "Re-exports the sound context hook for easy access.",
  "frontend/src/index.css": "Global Tailwind CSS config with color themes, dark mode variables, and safe-area utilities.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CirclePage.tsx": "Circle page with tabs for members, requests, join options, and safe people, plus energy card and filtered status posts.",
  "frontend/src/pages/CirclesImInPage.tsx": "Shows circles the user belongs to, with loading, error, and empty states, rendering owners with avatars.",
  "frontend/src/pages/ClosestConnectionsPage.tsx": "Displays ranked closest connections with avatars and details, handling loading, errors, and empty states.",
  "frontend/src/pages/ComposeStatusPage.tsx": "Status composer allowing mood selection, content entry, audience selection, and posting with validation.",
  "frontend/src/pages/DailyCheckInPage.tsx": "Daily check‑in flow similar to status compose, gated by reminder guard and mood history logic.",
  "frontend/src/pages/FeedPage.tsx": "Main feed showing status updates, silent signals, reminders, and refresh actions with empty and loading views.",
  "frontend/src/pages/HomeRoutePage.tsx": "Home route deciding between public home, loading screen, or authenticated feed inside layout and profile gate.",
  "frontend/src/pages/InviteCodeAuthStepPage.tsx": "Handles invite-code-based login flow, auto-joining a circle after Internet Identity authentication and managing stored invite codes.",
  "frontend/src/pages/NotificationsPage.tsx": "Displays unread and read notifications, supports marking items or all as read, and navigates to related status pages.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits user profile details including avatar, preferences, and age visibility, with save and cancel workflows.",
  "frontend/src/pages/PublicHomePage.tsx": "Public landing page allowing users to enter an invite code or start account creation, with basic feature descriptions.",
  "frontend/src/pages/StartAuthPage.tsx": "Initiates Internet Identity login for account creation or sign-in and redirects to the app after authentication.",
  "frontend/src/pages/StatusDetailPage.tsx": "Loads and displays a single status post, handling permission and not‑found errors with fallback messaging.",
  "frontend/src/utils/age.ts": "Utility functions for calculating age, formatting birthdates, and converting date inputs to bigint timestamps.",
  "frontend/src/utils/audience.ts": "Builds a unique Principal audience list for a post, always including the author.",
  "frontend/src/utils/circleEnergy.ts": "Analyzes recent posts to derive a weekly vibe and generates a non-clinical summary sentence.",
  "frontend/src/utils/contextTags.ts": "Normalizes and validates custom context tags, checking length and duplicates.",
  "frontend/src/utils/dailyCheckInEntry.ts": "Manages a sessionStorage guard flag for one-time daily check-in entry flow.",
  "frontend/src/utils/inviteCodeSession.ts": "Stores, normalizes, retrieves, and clears invite codes in sessionStorage.",
  "frontend/src/utils/microActions.ts": "Provides a micro‑action library and rule engine to suggest brief supportive actions based on mood history and tags.",
  "frontend/src/utils/moodAnalysis.ts": "Computes mood distribution, trends, concern levels, and guidance with a non-clinical disclaimer.",
  "frontend/src/utils/moodColors.ts": "Maps mood categories to Tailwind color and gradient class sets for UI styling.",
  "frontend/src/utils/moodReminder.ts": "Handles daily mood‑check reminder dismissal using localStorage keyed by date.",
  "frontend/src/utils/profileAvatar.ts": "Resolves avatar sources, validates uploads, converts files to bytes, and handles blob URL cleanup.",
  "frontend/src/utils/shareCode.ts": "Generates a 6‑character uppercase alphanumeric share code without ambiguous characters.",
  "frontend/src/utils/soundPreferences.ts": "Gets and sets a boolean sound‑enabled preference in localStorage with safe fallbacks.",
  "frontend/src/utils/time.ts": "Converts between backend time and JS Date and provides date utilities like day boundaries and formatting.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored or hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, plugins, content paths, and an extended theme including colors, radius, shadows, and layout settings.",
  "project_state.json": "Tracks project state, architecture notes, and known issues related to frontend, backend, routing, storage, and feature rollout."
}