{
  "kind": "build_request",
  "title": "Allow users with zero circle members to post self-only mood updates",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Update backend status posting validation so a user with zero circle members can successfully post a mood/status when the post audience is self-only (i.e., the audience list contains only the caller/author).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Enable a user without a circle member to be able to post a mode",
          "1. Yes",
          "They should remain private/self-only"
        ]
      },
      "acceptanceCriteria": [
        "Given a caller with no circle (circles.get(caller) is null), calling postStatus with audience == [caller] succeeds (no trap).",
        "Given a caller with no circle, calling postStatus with audience containing any principal other than caller traps with an unauthorized error (audience recipients must be in the caller's circle).",
        "Backend continues to enforce that the caller must have a profile before posting statuses."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Ensure backend normalizes/enforces self-visibility for status posts by always including the caller in the stored audience (deduplicated), without requiring circle membership for this self-only case.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "If a client submits a status with an audience that does not include the caller, the stored status audience still includes the caller (no duplicates).",
        "If a client submits audience == [], the stored status audience becomes [caller] and the post succeeds even when the caller has no circle members."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the Compose status UI (ComposeStatusPage) so users with zero selectable circle members can still post, with the audience effectively defaulting to self-only/private and communicated in the UI using English copy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Enable a user without a circle member to be able to post a mode",
          "1. Yes"
        ]
      },
      "acceptanceCriteria": [
        "On /compose, when selectableMembers.length === 0, the UI does not block submission and posting succeeds (no backend audience validation error).",
        "The audience section clearly indicates the post will be private/self-only when there are no circle members (English user-facing text).",
        "The submitted audience for this case results in a self-only audience on the backend (caller-only)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Update the Daily check-in UI (DailyCheckInPage) so users with zero selectable circle members can still post, defaulting to self-only/private audience with clear English microcopy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Enable a user without a circle member to be able to post a mode",
          "1. Yes"
        ]
      },
      "acceptanceCriteria": [
        "On /daily-check-in, when selectableMembers.length === 0, the UI does not block submission and posting succeeds (no backend audience validation error).",
        "The audience section indicates the post will be private/self-only when there are no circle members (English user-facing text).",
        "The submitted audience for this case results in a self-only audience on the backend (caller-only)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Preserve privacy of self-only posts after the user later joins a circle: self-only posts must remain visible only to the author and must not automatically become visible to new circle members.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "They should remain private/self-only"
        ]
      },
      "acceptanceCriteria": [
        "After a user posts a self-only status (audience caller-only) and later joins a circle, other circle members cannot access that status via getFeed or getStatus.",
        "The author continues to see the self-only status in their own feed/history."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor; implement all logic changes in backend/main.mo.",
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Changing how circle membership is modeled or adding new circle concepts.",
    "Adding new authentication methods beyond existing Internet Identity.",
    "Creating new feed/history screens; rely on existing feed behavior to show the author their own posts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}