{
  "kind": "build_request",
  "title": "Remove footer attribution and relocate a small “Built by Abel Odoh” line under the CloseCircle logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Remove the existing footer attribution block from the authenticated app layout so it no longer renders at the bottom of the screen (including removing the “Powered by Internet Computer” line and ICP logo from the UI).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "Delete the footer of © CloseCircle. 2026. Built by\nAbel Odoh\nusing Caffeine AI\n\n•\nPowered by Internet Computer.",
          "Find somewhere else to put this information",
          "you want the footer removed"
        ]
      },
      "acceptanceCriteria": [
        "No footer credit/attribution content is visible anywhere in the app layout footer area after login",
        "The “Powered by Internet Computer” text and ICP logo are not displayed in the UI footer area"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add a small attribution line reading exactly “Built by Abel Odoh” directly under the “CloseCircle” logo/title on the login screen, styled with a much smaller, muted font so it reads like subtle secondary text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Maybe close to the logo CloseCircle, \"Built by\nAbel Odoh\" but with very smaller font, under the logo"
        ]
      },
      "acceptanceCriteria": [
        "On the login screen, a new line “Built by Abel Odoh” appears directly below the “CloseCircle” title",
        "The attribution line is visually smaller than the title and uses a subdued/muted style"
      ]
    }
  ],
  "constraints": [
    "Frontend files listed as immutable in SYSTEM_CONTEXT must not be edited; compose changes through other files only.",
    "No backend changes; keep the single-actor Motoko architecture unchanged."
  ],
  "nonGoals": [
    "Do not add new settings/about pages or other new navigation destinations for attribution.",
    "Do not change Internet Identity login behavior, routing, or any existing feature unrelated to attribution placement."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}