{
  "kind": "build_request",
  "title": "Fix logout redirect to always return to public homepage (/)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Update the Sign Out action in the authenticated header so that after a successful logout it always redirects the user to the public root route \"/\" (homepage), regardless of the current page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Let's fix the logout issue that doesn't take me back to homepage once again",
          "1. Yes, always back to root route “/”",
          "implement now"
        ]
      },
      "acceptanceCriteria": [
        "From any authenticated route (e.g., /circle, /profile, /closest-connections), clicking “Sign Out” navigates to \"/\" after logout completes.",
        "The navigation uses a replace-style redirect (no back-navigation into authenticated pages after logout).",
        "React Query cache is cleared on logout as it is today, and the redirect still occurs."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Ensure authenticated-only routes cannot remain visible after identity is cleared: when the app is currently rendering under the authenticated layout and the Internet Identity becomes undefined (and initialization is not in progress), immediately redirect to \"/\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Logout does not consistently redirect users away from authenticated-only routes; after logout, protected pages can still render a logged-in-only error state instead of returning to the public homepage.",
          "1. Yes, always back to root route “/”"
        ]
      },
      "acceptanceCriteria": [
        "If a user logs out while on an authenticated route, the app does not remain on that route showing any protected/error state; it redirects to \"/\".",
        "If the user manually visits an authenticated URL after logout (e.g., pasting /profile), they are redirected to \"/\".",
        "No infinite redirect loop occurs during initial identity loading (i.e., do not redirect while identity is still initializing)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify any files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT.",
    "Backend remains single-actor; no backend changes are required for this logout redirect fix."
  ],
  "nonGoals": [
    "Do not redesign the public homepage or login flow UI.",
    "Do not change authentication provider behavior (Internet Identity / AuthClient configuration) beyond what is necessary to perform the redirect.",
    "Do not add new routes or change existing route paths."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}