{
  "kind": "build_request",
  "title": "Show a bell icon next to each circle member name on the Circle page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Circle page members tab, display a bell icon next to each circle member’s display name in the members list (i.e., in `frontend/src/components/circle/CircleMembersList.tsx` within the row that currently renders the member name and optional age). The bell should appear for each listed member (excluding the current user, consistent with the existing `otherMembers` filtering).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-usr-1",
          "msg-usr-2"
        ],
        "quotes": [
          "Do you remember the ping a circle member feature?\n\nAdd the bell next to the circle member name on the circle page",
          "Apply the change now"
        ]
      },
      "acceptanceCriteria": [
        "In the Circle page (Members tab), each listed member row shows a bell icon visually adjacent to the member name.",
        "The bell icon is not shown for the current user if they are excluded from the list (current behavior).",
        "The member name, optional age, pulse badge, and remove-member control continue to render and function as before (no regressions)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under the immutable frontend paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`)."
  ],
  "nonGoals": [
    "Implementing or changing the backend logic for the ping action itself (this request is only to place the bell icon next to names).",
    "Adding new notification types or altering the Notifications page behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}