{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix logout redirect and enforce post-logout public routing",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Make “Sign Out” always redirect to the public homepage (\"/\") with replace navigation after logout completes, while keeping React Query cache clearing.",
      "acceptanceCriteria": [
        "From any authenticated route (e.g., /circle, /profile, /closest-connections), clicking “Sign Out” navigates to \"/\" after logout completes.",
        "The navigation uses a replace-style redirect (no back-navigation into authenticated pages after logout).",
        "React Query cache is cleared on logout as it is today, and the redirect still occurs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Adjust the `clear` (logout) function to return a Promise that resolves only after logout has completed and identity state has been cleared, so callers can reliably redirect after a successful logout. (Authorization component logout guidance applies—verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/app/AppHeader.tsx",
          "operation": "modify",
          "description": "Update the “Sign Out” action to (1) await logout completion via `clear()`, (2) clear the React Query cache as it does today, and (3) navigate to \"/\" using replace-style navigation so the user cannot go back into authenticated pages. (Authorization component logout guidance applies—verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Redirect away from authenticated-only layout immediately when identity becomes undefined (and initialization is not in progress).",
      "acceptanceCriteria": [
        "If a user logs out while on an authenticated route, the app does not remain on that route showing any protected/error state; it redirects to \"/\".",
        "If the user manually visits an authenticated URL after logout (e.g., pasting /profile), they are redirected to \"/\".",
        "No infinite redirect loop occurs during initial identity loading (i.e., do not redirect while identity is still initializing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/app/AppLayout.tsx",
          "operation": "modify",
          "description": "Add an authenticated-layout guard effect that watches `identity` and `isInitializing` from `useInternetIdentity`; when identity becomes undefined and initialization is not in progress, immediately navigate to \"/\" with replace-style navigation. This ensures protected routes cannot remain visible after logout and prevents loops during initialization. (Authorization component auth-state guidance applies—verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}