{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Optional private mood context tags in status compose flow (frontend)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add a post-mood-selection Context Tags section in Compose Status with predefined multi-select and custom tag creation/removal.",
      "acceptanceCriteria": [
        "The tags UI is not shown until a mood is selected",
        "Users can select multiple predefined tags",
        "Users can add a custom tag and select it",
        "Selected tags are shown as selected chips/badges and can be removed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/status/ContextTagsPicker.tsx",
          "operation": "create",
          "description": "Create a reusable ContextTagsPicker component that renders a subtle context-tags section (only when enabled by the parent), supports multi-select predefined tags, adding custom tags, and removing selected tags via chip/badge UI. Use existing composed UI primitives (e.g., Button/Badge/Input/Label) without modifying the ui component library."
        },
        {
          "path": "frontend/src/constants/contextTags.ts",
          "operation": "create",
          "description": "Add a predefined context tag list (e.g., work/family/health/etc.) and shared configuration values (e.g., soft limit, max custom tag length) used by the ContextTagsPicker and compose flow."
        },
        {
          "path": "frontend/src/pages/ComposeStatusPage.tsx",
          "operation": "modify",
          "description": "Wire ContextTagsPicker into the Compose Status flow so it appears only after a mood is selected; store selected tags in ComposeStatusPage state and allow selection/removal of predefined and custom tags."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a calm soft-limit UX for context tag selection that discourages exceeding the recommended maximum without blocking posting.",
      "acceptanceCriteria": [
        "A soft limit exists and is enforced as a gentle UX constraint (not a hard error that prevents posting)",
        "When the user exceeds the soft limit, the UI displays a subtle, calm message indicating the recommended maximum",
        "Posting a status remains possible even if the user exceeds the soft limit"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/status/ContextTagsPicker.tsx",
          "operation": "modify",
          "description": "Implement soft-limit messaging within ContextTagsPicker (e.g., show a subtle inline note when selected tag count exceeds the configured soft limit) while continuing to allow additional tag selection and removals."
        },
        {
          "path": "frontend/src/constants/contextTags.ts",
          "operation": "modify",
          "description": "Define/adjust the soft limit configuration value used to trigger the gentle UX guidance."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Send selected context tags in the Compose Status submission while ensuring the feed and status detail UIs continue to display no tag indicators.",
      "acceptanceCriteria": [
        "Compose Status submission sends the selected tags to the backend as part of the status payload",
        "Feed UI continues to show no tag indicators (no chips/labels/metadata) for any posts",
        "No tag indicators appear on the status detail UI for non-authors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ComposeStatusPage.tsx",
          "operation": "modify",
          "description": "Include contextTags in the StatusPost payload passed to usePostStatus.mutateAsync (always send an array; send an empty array when none are selected) so the backend can persist them while keeping the feature optional."
        },
        {
          "path": "frontend/src/components/status/StatusCard.tsx",
          "operation": "modify",
          "description": "Add a defensive non-display guarantee by ensuring StatusCard does not render any context-tags-related metadata even if contextTags is present on the StatusPost object."
        },
        {
          "path": "frontend/src/pages/FeedPage.tsx",
          "operation": "modify",
          "description": "Confirm FeedPage continues to render StatusCard without any context tags UI; ensure no new tag indicators are introduced at the feed level."
        },
        {
          "path": "frontend/src/pages/StatusDetailPage.tsx",
          "operation": "modify",
          "description": "Confirm StatusDetailPage continues to render StatusCard without any context tags UI; ensure no new tag indicators are introduced at the status-detail level."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Normalize and validate custom context tags on the frontend (trim, disallow empty, prevent case-insensitive duplicates, enforce max length with inline messaging).",
      "acceptanceCriteria": [
        "Empty/whitespace-only custom tags cannot be added",
        "Duplicate tags (case-insensitive) cannot be added",
        "Custom tags longer than the configured maximum cannot be added (user gets a clear inline message)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/contextTags.ts",
          "operation": "create",
          "description": "Add utility helpers to normalize and validate custom tags (trim, collapse whitespace if desired, compare case-insensitively for duplicates, and enforce max length), returning user-friendly validation results for inline UI messaging."
        },
        {
          "path": "frontend/src/components/status/ContextTagsPicker.tsx",
          "operation": "modify",
          "description": "Use the context tag normalization/validation utilities to prevent adding empty/duplicate/too-long custom tags and display a clear inline message when validation fails."
        },
        {
          "path": "frontend/src/constants/contextTags.ts",
          "operation": "modify",
          "description": "Define/adjust the maximum custom tag length configuration used by the validation utilities and the ContextTagsPicker UI."
        }
      ]
    }
  ]
}