{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Self-only status posting UX when a user has zero circle members",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Update ComposeStatusPage to allow posting with zero circle members by defaulting audience to self-only/private and clearly communicating this in English.",
      "acceptanceCriteria": [
        "On /compose, when selectableMembers.length === 0, the UI does not block submission and posting succeeds (no backend audience validation error).",
        "The audience section clearly indicates the post will be private/self-only when there are no circle members (English user-facing text).",
        "The submitted audience for this case results in a self-only audience on the backend (caller-only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ComposeStatusPage.tsx",
          "operation": "modify",
          "description": "When selectableMembers.length === 0, replace the current empty-state copy with explicit English microcopy that the post will be private/self-only (only you can see it). Ensure submission remains enabled. Add logic to prune/clear selectedAudience when circleMembers/selectableMembers changes so stale selections cannot cause an unauthorized audience submission."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Update DailyCheckInPage to allow posting with zero circle members by defaulting audience to self-only/private and clearly communicating this in English.",
      "acceptanceCriteria": [
        "On /daily-check-in, when selectableMembers.length === 0, the UI does not block submission and posting succeeds (no backend audience validation error).",
        "The audience section indicates the post will be private/self-only when there are no circle members (English user-facing text).",
        "The submitted audience for this case results in a self-only audience on the backend (caller-only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DailyCheckInPage.tsx",
          "operation": "modify",
          "description": "When selectableMembers.length === 0, replace the current empty-state copy with explicit English microcopy that the post will be private/self-only (only you can see it). Ensure submission remains enabled. Add logic to prune/clear selectedAudience when circleMembers/selectableMembers changes so stale selections cannot cause an unauthorized audience submission."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Preserve and communicate privacy for self-only posts after joining a circle by reflecting self-only visibility in the UI and handling inaccessible status views gracefully.",
      "acceptanceCriteria": [
        "After a user posts a self-only status (audience caller-only) and later joins a circle, other circle members cannot access that status via getFeed or getStatus.",
        "The author continues to see the self-only status in their own feed/history."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/status/StatusCard.tsx",
          "operation": "modify",
          "description": "Add a small, English visibility indicator for the author when a status is self-only (e.g., when isOwnStatus is true and the status audience indicates caller-only), so that self-only posts remain clearly labeled as private even after the user later joins a circle."
        },
        {
          "path": "frontend/src/pages/StatusDetailPage.tsx",
          "operation": "modify",
          "description": "Adjust the error/empty-state messaging to clearly distinguish private/self-only access denial (English copy), ensuring that if a user cannot access a status they are told it may be private and they do not have permission—without revealing any status content."
        }
      ]
    }
  ]
}