{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Closest Connections viewer + smarter Safe People recommendations (frontend)",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Add an authenticated, deep-link-only Closest Connections viewer page that displays ranked recommendations with per-person explanation text.",
      "acceptanceCriteria": [
        "A new authenticated route is added under the existing authenticated layout (no BottomNav item added).",
        "The page fetches closest-connection recommendations via a centralized React Query hook and renders a ranked list.",
        "Each list row shows the person’s avatar and name (and may fall back gracefully if profile data is unavailable).",
        "Each list row provides a way to view the explanation text (e.g., collapsible/accordion), and the explanation text is shown only on this page (not inside Safe People selection UI).",
        "The page has loading, error, and empty states consistent with existing page patterns."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ClosestConnectionsPage.tsx",
          "operation": "create",
          "description": "Create the authenticated Closest Connections viewer page that calls the new closest-connections React Query hook, renders a ranked list with avatar/name fallbacks, and uses the existing ProgressiveDisclosure collapsible UI to show explanation strings per person (reasoning visible only on this page). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new deep-link-only authenticated child route (under the existing authenticated layout) that renders ClosestConnectionsPage, without adding any BottomNav navigation item."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Add a centralized React Query hook for closest-connection recommendations with stable caching and invalidation after relationship/interaction mutations.",
      "acceptanceCriteria": [
        "A new hook exists (in the existing query hooks module) that queries the backend closest-connections API and returns typed data usable by both the Safe People UI and the Closest Connections page.",
        "The hook uses a stable queryKey (including limit) and does not run until the actor is ready, matching existing patterns in frontend/src/hooks/useQueries.ts.",
        "The query is invalidated (directly or via existing invalidations) after relevant mutations at minimum: posting a status (interaction frequency), accepting a join request, and removing a circle member (relationship graph changes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend interface typings to include the new backend closest-connections query method and its return type (including per-person ordered explanation strings), so the new React Query hook and Closest Connections page can be strongly typed."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new centralized React Query hook (in this module) to fetch closest-connection recommendations with a stable queryKey that includes the requested limit and is enabled only when the actor is ready. Also wire invalidation of this query in onSuccess handlers for usePostStatus, useAcceptJoinRequest, and useRemoveCircleMember so recommendations refresh after interaction/relationship signal changes."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Update Safe People selection UI to prioritize smarter recommendations (max 2) without auto-selecting or showing reasoning; add navigation to the Closest Connections viewer.",
      "acceptanceCriteria": [
        "SafePeoplePanel continues to enforce a maximum of 2 selected Safe People and never auto-selects or overwrites existing selections.",
        "SafePeoplePanel visually highlights or prioritizes recommended candidates (e.g., a “Recommended” section or badge) based on the recommendations hook, while still allowing manual selection as before.",
        "SafePeoplePanel does not display the per-person explanation text (reasoning) anywhere in the Safe People UI.",
        "SafePeoplePanel provides a simple in-app navigation affordance to open the Closest Connections viewer page (the viewer remains absent from global navigation like BottomNav)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/circle/SafePeoplePanel.tsx",
          "operation": "modify",
          "description": "Integrate the closest-connections recommendations hook to visually prioritize/highlight recommended candidates (e.g., reorder into a 'Recommended' section and/or add a badge) while preserving the existing manual selection flow and max-2 enforcement. Do not render any explanation/reasoning text here. Add an in-panel Link/button that navigates to the deep-link Closest Connections viewer route. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}