{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 6,
  "summary": "CloseCircle is a privacy-focused, invite-only mood check-in web app built as a React SPA that talks to a Motoko canister on the Internet Computer. Users authenticate with Internet Identity, complete a required onboarding profile (name, gender, DOB/age visibility, relationship intent, preferences), and use a personal share code to form a trusted “circle” via join requests. Within a circle, users post mood statuses from a categorized mood catalog, optionally add a short note and context tags, and choose a per-post audience from their circle. The app provides a feed (polled) of accessible posts, status detail pages with permission-aware UX, an in-app notifications inbox (polled) with read/unread state, circle management (members, join requests, join-by-code, share code updates), a private daily journal overlay (today editable, past view-only in UI), private mood insights (distribution/trend/conservative concern guidance + disclaimer), and a “Circle Energy” weekly vibe summary. The product also centralizes and reuses “foundation” Promise/Boundary copy across key surfaces for consistent purpose/limitations messaging.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "App shell with routing, layout, theming, and global toasts",
      "synonyms": [
        "TanStack Router routes",
        "AppLayout",
        "next-themes",
        "sonner Toaster"
      ],
      "description": "Defines authenticated routes (feed, circle, compose, notifications, profile, status detail), wraps content in a shared layout (header, bottom nav, floating action button, journal overlay), enables light/dark themes, and provides a global toast system for user feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Internet Identity authentication with session restore and login/logout state flags",
      "synonyms": [
        "InternetIdentityProvider",
        "AuthClient login",
        "DelegationIdentity restore"
      ],
      "description": "Authenticates users via Internet Identity, restores existing sessions on load, exposes login/logout actions, and provides detailed status flags (initializing/logging-in/success/error) for UI gating and messaging.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Authentication gate for protected app access",
      "synonyms": [
        "AuthGate",
        "login wall"
      ],
      "description": "Prevents access to the app until Internet Identity initialization completes; shows a loader while initializing and renders the LoginPanel when unauthenticated.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Profile gate enforcing onboarding before app use",
      "synonyms": [
        "ProfileGate",
        "required onboarding"
      ],
      "description": "Blocks access to the main app until the user has a stored profile; shows a guided ProfileSetupDialog for new users and a calm loading state while the profile query resolves.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Per-principal canister actor creation and query invalidation on identity change",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "actor refresh"
      ],
      "description": "Creates an anonymous actor when logged out and an authenticated actor when logged in (with agent identity). When the actor instance changes (e.g., identity change), it invalidates and refetches all non-actor React Query caches to keep data scoped to the current principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Backend role-based access control (RBAC) bootstrap and admin checks",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "admin token bootstrap"
      ],
      "description": "Implements admin/user/guest roles in Motoko. A bootstrap call initializes the caller’s role based on a canister environment secret; includes query helpers (getCallerUserRole/isCallerAdmin) and an admin-only role assignment method.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Centralized React Query hooks for backend operations",
      "synonyms": [
        "useQueries",
        "query key conventions",
        "cache invalidation"
      ],
      "description": "Wraps canister methods for profiles, share code updates, join requests, circle members, feed/status detail, and notifications into React Query hooks with consistent query keys, enabled guards based on actor availability, polling intervals where needed, and mutation-driven cache invalidation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Foundation copy constants as a single source of truth",
      "synonyms": [
        "FOUNDATION_PROMISE",
        "FOUNDATION_BOUNDARY",
        "foundationCopy.ts"
      ],
      "description": "Defines the product’s core Promise and Boundary statements as reusable constants, avoiding duplicated hard-coded strings across the UI.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Foundation copy integrated into login experience",
      "synonyms": [
        "LoginPanel foundation messaging"
      ],
      "description": "Displays the Promise and Boundary copy on the login screen in a non-intrusive card to set expectations and reinforce the app’s purpose before sign-in.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Foundation copy integrated into onboarding/profile setup",
      "synonyms": [
        "ProfileSetupDialog foundation messaging"
      ],
      "description": "Shows the Promise and Boundary copy during onboarding (at least in the first step) so new users understand the product intent and limitations while creating their profile.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Foundation copy integrated into key in-app surfaces",
      "synonyms": [
        "Feed empty state foundation copy",
        "Compose header foundation copy",
        "Status permission state foundation copy"
      ],
      "description": "Surfaces the Promise/Boundary copy in authenticated areas where reassurance is useful, including feed empty state, compose page header, and the status detail permission/error state.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Login panel with branding, rotating calm copy, and privacy highlights",
      "synonyms": [
        "APP_NAME branding",
        "loginCopy rotation"
      ],
      "description": "Provides a branded login screen with randomized calm hero/card subtext (stable per mount) and simple feature callouts emphasizing invite-only and trusted-circle sharing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Multi-step profile setup with share code generation and clipboard copy",
      "synonyms": [
        "ProfileSetupDialog",
        "generateShareCode"
      ],
      "description": "Guided onboarding collects name, gender, DOB (validated not in the future), relationship intent, and preferred gender; generates a 6-character user-friendly share code; supports copying to clipboard; and saves the profile to the canister.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Profile view and edit with age visibility toggle",
      "synonyms": [
        "ProfilePage",
        "showAge toggle",
        "updateProfile"
      ],
      "description": "Lets users view and edit profile fields with client-side validation, including a switch controlling whether their age is visible to circle members. Editing mode hides the floating compose button to reduce UI clutter.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Share code view/copy and update workflow",
      "synonyms": [
        "ShareCodeCard",
        "updateShareCode"
      ],
      "description": "Displays the user’s current share code with copy-to-clipboard and provides an edit flow to update it; inputs are normalized (trim + uppercase) before submission.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Join a circle by share code (request-based)",
      "synonyms": [
        "JoinByCodeForm",
        "joinCircleFromShareCode"
      ],
      "description": "Allows users to request access to someone else’s circle by entering a share code (trimmed and uppercased); the canister records a join request and generates a notification for the circle owner.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Pending join requests inbox with accept/decline",
      "synonyms": [
        "PendingRequestsPanel",
        "getUnprocessedJoinRequests",
        "acceptJoinRequest",
        "declineJoinRequest"
      ],
      "description": "Circle owners can review unprocessed join requests, see requester metadata (if profile is accessible), and accept or decline requests; acceptance adds the requester to the owner’s circle.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Circle members list with profile metadata and removal",
      "synonyms": [
        "CircleMembersList",
        "getCircleMembers",
        "removeCircleMember"
      ],
      "description": "Shows circle members (excluding self), displays profile metadata (name, gender, intent, and age when the member allows showAge), and supports removal via a confirmation dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Mood catalog constants and helper presenters",
      "synonyms": [
        "MOODS",
        "presentMood",
        "getMoodLabel/getMoodEmoji"
      ],
      "description": "Defines a categorized mood catalog (label/emoji/category) mapped to backend Mood values, with helper functions to safely present moods (including fallback handling).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Searchable, categorized mood picker UI",
      "synonyms": [
        "MoodPicker",
        "mood search"
      ],
      "description": "Provides a mood selection component with search filtering, grouping by category, selection highlighting, and optional autofocus for deep-linked flows.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Context tags selection with predefined and custom tags",
      "synonyms": [
        "ContextTagsPicker",
        "validateCustomTag"
      ],
      "description": "Lets users add context via predefined tags and custom tags with validation (non-empty, max length, case-insensitive de-duplication) and includes a soft-limit guidance message.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Compose and post mood status with per-post audience selection",
      "synonyms": [
        "ComposeStatusPage",
        "postStatus"
      ],
      "description": "Users select a mood, optionally add a short note and context tags, pick a per-post audience from circle members, and submit a status. UI validates required fields and shows success/error toasts; deep-links can auto-scroll and focus the mood search input.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Backend status posting with audience enforcement, context-tag sanitization, and notification fanout",
      "synonyms": [
        "postStatus validation",
        "sanitizeStatusForViewer",
        "audience notifications"
      ],
      "description": "Canister enforces that the audience is non-empty and composed of circle members. Feed/status reads are filtered to author/audience and sanitize contextTags for non-authors. Posting generates notifications for audience members (excluding the author) that deep-link to the status.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Feed browsing with polling, manual refresh, and empty-state UX",
      "synonyms": [
        "FeedPage",
        "useGetFeed"
      ],
      "description": "Displays accessible status posts with client-side stable newest-first sorting, polls periodically for updates, supports manual refresh, shows a mood check-in reminder card, and renders a supportive empty state with a compose CTA when no posts exist.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Status detail view with permission-aware error handling",
      "synonyms": [
        "StatusDetailPage",
        "getStatus"
      ],
      "description": "Loads an individual status by ID and renders loading, not-found, or permission-denied states with a clear return-to-feed path and supportive boundary messaging.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Notifications inbox with polling, mark-as-read, and deep links",
      "synonyms": [
        "NotificationsPage",
        "getNotifications",
        "markNotificationAsRead"
      ],
      "description": "Fetches and polls notifications, groups unread vs earlier items, marks items as read on interaction, and navigates to linked status detail pages when a notification references a statusId.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Bottom navigation with unread notification badge",
      "synonyms": [
        "BottomNav",
        "alerts badge"
      ],
      "description": "Provides a fixed bottom navigation for Feed, Circle, Compose, and Alerts, including an unread badge count capped at “9+”.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Once-per-day mood check-in reminder with dismissal persistence",
      "synonyms": [
        "MoodCheckInReminderCard",
        "moodReminder localStorage"
      ],
      "description": "Shows a subtle check-in reminder that can be dismissed once per local calendar day (persisted in localStorage) and deep-links to compose with focus behavior for quick mood selection.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Private daily journal overlay with date picker and entry CRUD",
      "synonyms": [
        "JournalOverlay",
        "JournalDatePicker",
        "JournalEntriesPanel",
        "useJournal hooks"
      ],
      "description": "Implements a right-side Sheet overlay journal with a date picker (future dates disabled), viewing entries for selected dates, creating entries for today, and deleting entries. UI locks editing for past dates and uses React Query hooks for range reads and mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Global journal overlay controller and post-status private reflection prompt",
      "synonyms": [
        "JournalOverlayControllerContext",
        "AppHeader journal button",
        "PostStatusPrivateNotePrompt"
      ],
      "description": "Provides a context-based controller to open/close the journal overlay (optionally resetting to today). After posting a status, the app prompts the user to optionally open the journal for a private reflection.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Mood history derivation and private mood analysis insights",
      "synonyms": [
        "useMoodHistory",
        "analyzeMoodPatterns",
        "MoodAnalyzerCard"
      ],
      "description": "Derives a user’s mood history from their own feed posts within a chosen timeframe (chronological ordering) and analyzes distribution, dominant mood, trend, conservative concern levels, and guidance text with a non-medical disclaimer.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Circle Energy weekly vibe summary",
      "synonyms": [
        "CircleEnergyCard",
        "generateCircleEnergySummary"
      ],
      "description": "Generates a single-sentence, non-clinical weekly vibe summary for accessible posts in the last 7 days, using sentiment bucketing, stable seeded phrase selection, and banned-term filtering.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "Sensitive secret parameter handling via URL hash and sessionStorage",
      "synonyms": [
        "getSecretParameter",
        "urlParams utilities",
        "admin token via hash"
      ],
      "description": "Utilities support reading sensitive values from the URL hash (instead of query strings), persisting them in sessionStorage for the session, and attempting to remove them from the URL to reduce accidental exposure; used to provide an admin bootstrap token to the canister initialization call.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-audit-and-update-all-user-facing-copy-so-it-never-implies-the-app-knows-detects-or-infers-how-the-user-or-the-circle-feels-all-language-must-frame-insights-as-patterns-based-on-what-users-selected-posted-e-g-you-selected-low-moods-posts-this-week-leaned-calm",
      "title": "Audit and update all user-facing copy so it never implies the app knows, detects, or infers how the user (or the circle) feels; all language must frame insights as patterns based on what users selected/posted (e.g., “You selected low moods” / “Posts this week leaned calm”).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-mood-analyzer-ui-and-its-generated-guidance-text-to-use-agency-preserving-non-inferential-wording-that-describes-distributions-trends-of-selected-moods-not-emotional-states-ensure-the-analyzer-description-and-guidance-do-not-use-clinical-diagnostic-framing",
      "title": "Update the Mood Analyzer UI and its generated guidance text to use agency-preserving, non-inferential wording that describes distributions/trends of selected moods, not emotional states; ensure the analyzer description and guidance do not use clinical/diagnostic framing.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-mood-picker-and-check-in-flow-remain-fully-user-chosen-no-default-pre-selection-no-auto-suggested-mood-and-no-copy-that-implies-a-recommendation-or-guess-adjust-surrounding-copy-in-compose-and-reminder-surfaces-to-reinforce-user-choice",
      "title": "Ensure the mood picker and check-in flow remain fully user-chosen: no default pre-selection, no auto-suggested mood, and no copy that implies a recommendation or guess; adjust surrounding copy in compose and reminder surfaces to reinforce user choice.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-update-circle-energy-summary-text-to-avoid-claiming-the-system-knows-the-circle-s-feelings-remove-replace-phrases-like-your-circle-feels-reframing-summaries-as-patterns-observed-in-posts-over-the-last-week",
      "title": "Update Circle Energy summary text to avoid claiming the system knows the circle’s feelings (remove/replace phrases like “Your circle feels…”), reframing summaries as patterns observed in posts over the last week.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "feature-update-login-onboarding-product-copy-that-currently-emphasizes-the-app-understanding-or-holding-feelings-so-it-instead-emphasizes-user-choice-and-private-sharing-of-selected-moods-while-keeping-the-existing-calm-tone",
      "title": "Update login/onboarding/product copy that currently emphasizes the app understanding or holding feelings so it instead emphasizes user choice and private sharing of selected moods, while keeping the existing calm tone.",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Scope 1 trust/safety: remove any auto-suggested mood/inference language; keep mood selection fully user-chosen; update analyzer/product copy to talk about patterns based on user selections (not inferred feelings).",
      "reqIds": [],
      "status": "in_progress"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using TanStack Router for routing and TanStack React Query for caching, polling, mutations, and cache invalidation.",
    "Authentication is handled via Internet Identity (@dfinity/auth-client) with a context provider exposing login/logout and granular status flags.",
    "Backend access uses a typed canister actor created by useActor; actor instances are keyed by principal and trigger broad query invalidation/refetch when identity changes.",
    "Motoko backend uses a mixin-based RBAC layer (AccessControl + MixinAuthorization) to gate canister methods by role.",
    "Near-real-time updates are implemented via polling (feed ~30s, notifications ~15s) plus manual refresh on the feed.",
    "UI is composed with Tailwind CSS + shadcn/ui primitives + lucide-react icons; next-themes provides light/dark theme support.",
    "Privacy enforcement is primarily server-side (per-post audience checks; contextTags sanitized for non-authors) with additional defensive UI choices (e.g., never rendering contextTags).",
    "Client-side insights (mood analyzer, mood history, circle energy) are derived from cached feed data and update automatically as queries refresh.",
    "Journal functionality is implemented as a global Sheet overlay controlled via React context to allow opening from multiple app surfaces.",
    "Sensitive bootstrap secrets (admin token) are read from the URL hash and persisted in sessionStorage to reduce accidental leakage from query strings."
  ],
  "known_issues": [
    "Backend generateRandomShareCode() is deterministic (index mod 36), making server-generated share codes predictable and potentially collision-prone if empty codes are allowed.",
    "Backend createOrUpdateJournalEntry() uses Time.now() as the entry “date” key and filters by exact equality, so repeated saves won’t reliably update/replace same-day entries; backend also doesn’t enforce the UI rule that past days are locked.",
    "useActor always calls _initializeAccessControlWithSecret() for authenticated users; if CAFFEINE_ADMIN_TOKEN is not set in the canister environment, the canister traps and the app cannot proceed.",
    "Multiple frontend paths convert bigint nanosecond timestamps to Number for sorting/date-fns, risking precision loss and subtle ordering/time display issues.",
    "Backend joinCircleFromShareCode() notification message uses the target (circle owner) profile name as the requester name, producing misleading notifications.",
    "Backend updateProfile() overwrites createdAt with Time.now(), losing original profile creation timestamp semantics even if the client supplies createdAt.",
    "Share code updates do not purge stale join-request records keyed by the previous share code, despite UI copy implying pending requests are invalidated.",
    "Canister state is stored in non-stable variables (Map/List) with no upgrade persistence shown; data may be lost on canister upgrades.",
    "Circle membership is stored only under the circle owner principal (one-sided), limiting member-centric features unless mirrored state is added.",
    "urlParams clearParamFromHash() only removes params from hash routes that include a '?' query segment; for simple '#token=value' style hashes, secrets may remain in the URL/history after extraction."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "CloseCircle",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}