{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 224,
  "summary": "CloseCircle will transition circle membership from one-sided (stored only under the owner) to a two-sided model by adding mirrored member→circles storage. Rollout will be gradual, starting with a backend-only storage change (no UI yet), with later planned member-side surfaces like “circles I’m in”, “people who have me in their circle”, a lightweight private relationship viewer, and smarter Safe People suggestions derived from existing relationship/interaction data.",
  "architectural_notes": [
    "Frontend is a React SPA using TanStack Router for routing and TanStack React Query for caching, polling, mutations, and cache invalidation.",
    "Authentication is handled via Internet Identity (@dfinity/auth-client) with a context provider exposing login/logout and granular status flags.",
    "Backend access uses a typed canister actor created by useActor; actor instances are keyed by principal and trigger broad query invalidation/refetch when identity changes.",
    "Motoko backend uses a mixin-based RBAC layer (AccessControl + MixinAuthorization) to gate canister methods by role.",
    "Near-real-time updates are implemented via polling (feed ~30s, notifications ~15s) plus manual refresh on the feed.",
    "UI is composed with Tailwind CSS + shadcn/ui primitives + lucide-react icons; next-themes provides light/dark theme support.",
    "Privacy enforcement is primarily server-side (per-post audience checks; contextTags sanitized for non-authors) with additional defensive UI choices (e.g., never rendering contextTags).",
    "Client-side insights (mood analyzer, mood history, circle energy) are derived from cached feed data and update automatically as queries refresh.",
    "Journal functionality is implemented as a global Sheet overlay controlled via React context to allow opening from multiple app surfaces.",
    "Sensitive bootstrap secrets (admin token) are read from the URL hash and persisted in sessionStorage to reduce accidental leakage from query strings."
  ],
  "known_issues": [
    "Backend generateRandomShareCode() is deterministic (index mod 36), making server-generated share codes predictable and potentially collision-prone if empty codes are allowed.",
    "Backend createOrUpdateJournalEntry() uses Time.now() as the entry “date” key and filters by exact equality, so repeated saves won’t reliably update/replace same-day entries; backend also doesn’t enforce the UI rule that past days are locked.",
    "Multiple frontend paths convert bigint nanosecond timestamps to Number for sorting/date-fns, risking precision loss and subtle ordering/time display issues.",
    "Share code updates do not purge stale join-request records keyed by the previous share code, despite UI copy implying pending requests are invalidated.",
    "Canister state is stored in non-stable variables (Map/List) with no upgrade persistence shown; data may be lost on canister upgrades.",
    "Circle membership is stored only under the circle owner principal (one-sided), limiting member-centric features unless mirrored state is added.",
    "Deployment: build/deploy pipeline encountered an unspecified deployment error during push to the network. Needs error details/log capture to diagnose.",
    "Logout does not consistently redirect users away from authenticated-only routes; after logout, protected pages can still render a logged-in-only error state instead of returning to the public homepage.",
    "UI layout: Fixed bottom footer/bottom bar overlaps page body content across multiple screens. Footer should remain fixed/visible, but scrollable page content must include sufficient bottom safe-area/padding so key controls (e.g., Check-In “Share” button) are never hidden; button does not need to be sticky.",
    "Profile update currently overwrites creation date (createdAt); backend should preserve original createdAt and ignore any client-supplied createdAt during updates."
  ],
  "isFixRequest": true,
  "generatedImages": [
    {
      "filename": "frontend/public/assets/generated/system-avatar-01.dim_256x256.png",
      "description": "Bundled default system avatar option #01.",
      "targetWidth": 256,
      "targetHeight": 256
    },
    {
      "filename": "frontend/public/assets/generated/system-avatar-02.dim_256x256.png",
      "description": "Bundled default system avatar option #02.",
      "targetWidth": 256,
      "targetHeight": 256
    },
    {
      "filename": "frontend/public/assets/generated/system-avatar-03.dim_256x256.png",
      "description": "Bundled default system avatar option #03.",
      "targetWidth": 256,
      "targetHeight": 256
    },
    {
      "filename": "frontend/public/assets/generated/system-avatar-04.dim_256x256.png",
      "description": "Bundled default system avatar option #04.",
      "targetWidth": 256,
      "targetHeight": 256
    },
    {
      "filename": "frontend/public/assets/generated/system-avatar-05.dim_256x256.png",
      "description": "Bundled default system avatar option #05.",
      "targetWidth": 256,
      "targetHeight": 256
    },
    {
      "filename": "frontend/public/assets/generated/system-avatar-06.dim_256x256.png",
      "description": "Bundled default system avatar option #06.",
      "targetWidth": 256,
      "targetHeight": 256
    },
    {
      "filename": "frontend/public/assets/generated/system-avatar-07.dim_256x256.png",
      "description": "Bundled default system avatar option #07.",
      "targetWidth": 256,
      "targetHeight": 256
    },
    {
      "filename": "frontend/public/assets/generated/system-avatar-08.dim_256x256.png",
      "description": "Bundled default system avatar option #08.",
      "targetWidth": 256,
      "targetHeight": 256
    }
  ],
  "existing_features": [
    {
      "id": "IF-1",
      "title": "App shell with routing, layout, theming, and global toasts",
      "synonyms": [
        "TanStack Router routes",
        "AppLayout",
        "next-themes",
        "sonner Toaster"
      ],
      "description": "Defines authenticated routes (feed, circle, compose, notifications, profile, status detail), wraps content in a shared layout (header, bottom nav, floating action button, journal overlay), enables light/dark themes, and provides a global toast system for user feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Internet Identity authentication with session restore and login/logout state flags",
      "synonyms": [
        "InternetIdentityProvider",
        "AuthClient login",
        "DelegationIdentity restore"
      ],
      "description": "Authenticates users via Internet Identity, restores existing sessions on load, exposes login/logout actions, and provides detailed status flags (initializing/logging-in/success/error) for UI gating and messaging.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Authentication gate for protected app access",
      "synonyms": [
        "AuthGate",
        "login wall"
      ],
      "description": "Prevents access to the app until Internet Identity initialization completes; shows a loader while initializing and renders the LoginPanel when unauthenticated.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Profile gate enforcing onboarding before app use",
      "synonyms": [
        "ProfileGate",
        "required onboarding"
      ],
      "description": "Blocks access to the main app until the user has a stored profile; shows a guided ProfileSetupDialog for new users and a calm loading state while the profile query resolves.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Per-principal canister actor creation and query invalidation on identity change",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "actor refresh"
      ],
      "description": "Creates an anonymous actor when logged out and an authenticated actor when logged in (with agent identity). When the actor instance changes (e.g., identity change), it invalidates and refetches all non-actor React Query caches to keep data scoped to the current principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Backend role-based access control (RBAC) bootstrap and admin checks",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "admin token bootstrap"
      ],
      "description": "Implements admin/user/guest roles in Motoko. A bootstrap call initializes the caller’s role based on a canister environment secret; includes query helpers (getCallerUserRole/isCallerAdmin) and an admin-only role assignment method.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Centralized React Query hooks for backend operations",
      "synonyms": [
        "useQueries",
        "query key conventions",
        "cache invalidation"
      ],
      "description": "Wraps canister methods for profiles, share code updates, join requests, circle members, feed/status detail, and notifications into React Query hooks with consistent query keys, enabled guards based on actor availability, polling intervals where needed, and mutation-driven cache invalidation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Foundation copy constants as a single source of truth",
      "synonyms": [
        "FOUNDATION_PROMISE",
        "FOUNDATION_BOUNDARY",
        "foundationCopy.ts"
      ],
      "description": "Defines the product’s core Promise and Boundary statements as reusable constants, avoiding duplicated hard-coded strings across the UI.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Foundation copy integrated into login experience",
      "synonyms": [
        "LoginPanel foundation messaging"
      ],
      "description": "Displays the Promise and Boundary copy on the login screen in a non-intrusive card to set expectations and reinforce the app’s purpose before sign-in.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Foundation copy integrated into onboarding/profile setup",
      "synonyms": [
        "ProfileSetupDialog foundation messaging"
      ],
      "description": "Shows the Promise and Boundary copy during onboarding (at least in the first step) so new users understand the product intent and limitations while creating their profile.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Foundation copy integrated into key in-app surfaces",
      "synonyms": [
        "Feed empty state foundation copy",
        "Compose header foundation copy",
        "Status permission state foundation copy"
      ],
      "description": "Surfaces the Promise/Boundary copy in authenticated areas where reassurance is useful, including feed empty state, compose page header, and the status detail permission/error state.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Login panel with branding, rotating calm copy, and privacy highlights",
      "synonyms": [
        "APP_NAME branding",
        "loginCopy rotation"
      ],
      "description": "Provides a branded login screen with randomized calm hero/card subtext (stable per mount) and simple feature callouts emphasizing invite-only and trusted-circle sharing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Multi-step profile setup with share code generation and clipboard copy",
      "synonyms": [
        "ProfileSetupDialog",
        "generateShareCode"
      ],
      "description": "Guided onboarding collects name, gender, DOB (validated not in the future), relationship intent, and preferred gender; generates a 6-character user-friendly share code; supports copying to clipboard; and saves the profile to the canister.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Profile view and edit with age visibility toggle",
      "synonyms": [
        "ProfilePage",
        "showAge toggle",
        "updateProfile"
      ],
      "description": "Lets users view and edit profile fields with client-side validation, including a switch controlling whether their age is visible to circle members. Editing mode hides the floating compose button to reduce UI clutter.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Share code view/copy and update workflow",
      "synonyms": [
        "ShareCodeCard",
        "updateShareCode"
      ],
      "description": "Displays the user’s current share code with copy-to-clipboard and provides an edit flow to update it; inputs are normalized (trim + uppercase) before submission.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Join a circle by share code (request-based)",
      "synonyms": [
        "JoinByCodeForm",
        "joinCircleFromShareCode"
      ],
      "description": "Allows users to request access to someone else’s circle by entering a share code (trimmed and uppercased); the canister records a join request and generates a notification for the circle owner.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Pending join requests inbox with accept/decline",
      "synonyms": [
        "PendingRequestsPanel",
        "getUnprocessedJoinRequests",
        "acceptJoinRequest",
        "declineJoinRequest"
      ],
      "description": "Circle owners can review unprocessed join requests, see requester metadata (if profile is accessible), and accept or decline requests; acceptance adds the requester to the owner’s circle.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Circle members list with profile metadata and removal",
      "synonyms": [
        "CircleMembersList",
        "getCircleMembers",
        "removeCircleMember"
      ],
      "description": "Shows circle members (excluding self), displays profile metadata (name, gender, intent, and age when the member allows showAge), and supports removal via a confirmation dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Mood catalog constants and helper presenters",
      "synonyms": [
        "MOODS",
        "presentMood",
        "getMoodLabel/getMoodEmoji"
      ],
      "description": "Defines a categorized mood catalog (label/emoji/category) mapped to backend Mood values, with helper functions to safely present moods (including fallback handling).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Searchable, categorized mood picker UI",
      "synonyms": [
        "MoodPicker",
        "mood search"
      ],
      "description": "Provides a mood selection component with search filtering, grouping by category, selection highlighting, and optional autofocus for deep-linked flows.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Context tags selection with predefined and custom tags",
      "synonyms": [
        "ContextTagsPicker",
        "validateCustomTag"
      ],
      "description": "Lets users add context via predefined tags and custom tags with validation (non-empty, max length, case-insensitive de-duplication) and includes a soft-limit guidance message.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Compose and post mood status with per-post audience selection",
      "synonyms": [
        "ComposeStatusPage",
        "postStatus"
      ],
      "description": "Users select a mood, optionally add a short note and context tags, pick a per-post audience from circle members, and submit a status. UI validates required fields and shows success/error toasts; deep-links can auto-scroll and focus the mood search input.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Backend status posting with audience enforcement, context-tag sanitization, and notification fanout",
      "synonyms": [
        "postStatus validation",
        "sanitizeStatusForViewer",
        "audience notifications"
      ],
      "description": "Canister enforces that the audience is non-empty and composed of circle members. Feed/status reads are filtered to author/audience and sanitize contextTags for non-authors. Posting generates notifications for audience members (excluding the author) that deep-link to the status.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Feed browsing with polling, manual refresh, and empty-state UX",
      "synonyms": [
        "FeedPage",
        "useGetFeed"
      ],
      "description": "Displays accessible status posts with client-side stable newest-first sorting, polls periodically for updates, supports manual refresh, shows a mood check-in reminder card, and renders a supportive empty state with a compose CTA when no posts exist.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Status detail view with permission-aware error handling",
      "synonyms": [
        "StatusDetailPage",
        "getStatus"
      ],
      "description": "Loads an individual status by ID and renders loading, not-found, or permission-denied states with a clear return-to-feed path and supportive boundary messaging.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Notifications inbox with polling, mark-as-read, and deep links",
      "synonyms": [
        "NotificationsPage",
        "getNotifications",
        "markNotificationAsRead"
      ],
      "description": "Fetches and polls notifications, groups unread vs earlier items, marks items as read on interaction, and navigates to linked status detail pages when a notification references a statusId.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Bottom navigation with unread notification badge",
      "synonyms": [
        "BottomNav",
        "alerts badge"
      ],
      "description": "Provides a fixed bottom navigation for Feed, Circle, Compose, and Alerts, including an unread badge count capped at “9+”.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Once-per-day mood check-in reminder with dismissal persistence",
      "synonyms": [
        "MoodCheckInReminderCard",
        "moodReminder localStorage"
      ],
      "description": "Shows a subtle check-in reminder that can be dismissed once per local calendar day (persisted in localStorage) and deep-links to compose with focus behavior for quick mood selection.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Private daily journal overlay with date picker and entry CRUD",
      "synonyms": [
        "JournalOverlay",
        "JournalDatePicker",
        "JournalEntriesPanel",
        "useJournal hooks"
      ],
      "description": "Implements a right-side Sheet overlay journal with a date picker (future dates disabled), viewing entries for selected dates, creating entries for today, and deleting entries. UI locks editing for past dates and uses React Query hooks for range reads and mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Global journal overlay controller and post-status private reflection prompt",
      "synonyms": [
        "JournalOverlayControllerContext",
        "AppHeader journal button",
        "PostStatusPrivateNotePrompt"
      ],
      "description": "Provides a context-based controller to open/close the journal overlay (optionally resetting to today). After posting a status, the app prompts the user to optionally open the journal for a private reflection.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Mood history derivation and private mood analysis insights",
      "synonyms": [
        "useMoodHistory",
        "analyzeMoodPatterns",
        "MoodAnalyzerCard"
      ],
      "description": "Derives a user’s mood history from their own feed posts within a chosen timeframe (chronological ordering) and analyzes distribution, dominant mood, trend, conservative concern levels, and guidance text with a non-medical disclaimer.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Circle Energy weekly vibe summary",
      "synonyms": [
        "CircleEnergyCard",
        "generateCircleEnergySummary"
      ],
      "description": "Generates a single-sentence, non-clinical weekly vibe summary for accessible posts in the last 7 days, using sentiment bucketing, stable seeded phrase selection, and banned-term filtering.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "Sensitive secret parameter handling via URL hash and sessionStorage",
      "synonyms": [
        "getSecretParameter",
        "urlParams utilities",
        "admin token via hash"
      ],
      "description": "Utilities support reading sensitive values from the URL hash (instead of query strings), persisting them in sessionStorage for the session, and attempting to remove them from the URL to reduce accidental exposure; used to provide an admin bootstrap token to the canister initialization call.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-34",
      "title": "Single daily check-in entry flow (DailyCheckInPage) routed from the once-per-day reminder",
      "synonyms": [
        "DailyCheckInPage",
        "dailyCheckInEntry util",
        "daily check-in card/flow"
      ],
      "description": "Introduces a dedicated Daily Check-In route/flow intended to be the single daily entry point. The existing once-per-day reminder now routes users into this focused daily check-in experience to reduce decision-making and provide clearer guidance.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-35",
      "title": "Actionable Mood Analyzer with rule-based micro-actions (≤2 minutes)",
      "synonyms": [
        "MicroActionsPanel",
        "microActions rules",
        "actionable insights",
        "pattern→suggestion mapping"
      ],
      "description": "Extends the private Mood Analyzer from descriptive insights to actionable guidance by mapping detected mood-history patterns (and related signals) to conservative, non-clinical micro-actions that take ≤2 minutes (e.g., breathing prompt, one-sentence journal, quiet reach-out). Implemented fully in the frontend via a rule-based micro-actions utility and surfaced through a dedicated UI panel alongside mood insights.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-36",
      "title": "Safe People (max 2) backend storage and APIs",
      "synonyms": [
        "Safe People list",
        "getSafePeople",
        "setSafePeople"
      ],
      "description": "Motoko backend stores a per-caller Safe People list (maximum 2 principals) and exposes read/update APIs restricted so only the caller can manage their own Safe People selection.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "IF-37",
      "title": "Global eligible circle connections API for Safe People selection",
      "synonyms": [
        "global circle connections",
        "eligible Safe People list"
      ],
      "description": "Backend exposes a mechanism to compute/return the caller’s eligible circle connections across circles they are part of (not only caller-owned circle) for Safe People selection and global delivery targeting.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "IF-38",
      "title": "Silent Signals backend feed item type with no-notification delivery rules",
      "synonyms": [
        "SilentSignal",
        "postSilentSignal",
        "silent signal feed item"
      ],
      "description": "Backend supports Silent Signals as a distinct feed item type that can be delivered to Safe People only by default and optionally to the entire circle, with an explicit rule that Silent Signals generate no notifications.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "IF-39",
      "title": "React Query hooks for Safe People, global connections, and Silent Signal posting",
      "synonyms": [
        "useSafePeople hooks",
        "useGlobalConnections",
        "usePostSilentSignal"
      ],
      "description": "Adds React Query hooks to fetch/update Safe People, fetch global eligible connections, and post Silent Signals, with cache invalidation so the feed updates after posting a signal.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "IF-40",
      "title": "Safe People management UI (choose up to 2)",
      "synonyms": [
        "SafePeoplePanel",
        "Safe People settings UI"
      ],
      "description": "Implements a UI panel to manage Safe People by selecting up to two people from eligible connections, showing current selections and allowing removal/changes with low-pressure copy.",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "IF-41",
      "title": "Silent Signal composer UI with delivery controls",
      "synonyms": [
        "SilentSignalComposerCard",
        "silent signal compose"
      ],
      "description": "Adds a lightweight composer for predefined Silent Signals (e.g., “Low energy today”, “Okay, just quiet”) defaulting to Safe People-only delivery with an explicit option to also share to the entire circle.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "IF-42",
      "title": "Silent Signals rendered as distinct lightweight feed items",
      "synonyms": [
        "SilentSignalCard",
        "feed silent signal rendering"
      ],
      "description": "Renders Silent Signals in the feed as distinct, lightweight items minimizing social pressure and explicitly avoiding reply/comment affordances.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "IF-43",
      "title": "Progressive disclosure UI utility to limit visible choices by default",
      "synonyms": [
        "ProgressiveDisclosure",
        "expand/collapse choice sets",
        "reduced cognitive load"
      ],
      "description": "Adds a reusable ProgressiveDisclosure component to initially hide secondary/advanced options and reveal them on demand, supporting the micro-UX goal of reducing decision-making in check-in/compose-related surfaces.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-44",
      "title": "Graceful canister/replica error handling in actor usage and join-by-code flow",
      "synonyms": [
        "useActorWithError",
        "IC0508 handling",
        "user-friendly replica errors"
      ],
      "description": "Introduces a dedicated actor hook with normalized error handling and updates the join-by-share-code experience to avoid raw replica errors (including IC0508 canister-stopped cases), providing clearer user-facing messaging and guardrails.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-45",
      "title": "Mood color mapping utility for consistent mood-based UI accents",
      "synonyms": [
        "moodColors",
        "mood→color mapping",
        "visual mood cues"
      ],
      "description": "Adds a centralized mood color utility to map moods to a consistent color palette for UI accents, enabling more visual-first mood communication across components.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-47",
      "title": "User-facing light/dark mode toggle control",
      "synonyms": [
        "ThemeToggleButton",
        "theme switch",
        "dark mode toggle"
      ],
      "description": "Adds an explicit UI control to let users toggle between light and dark themes at runtime, leveraging the existing next-themes setup for persistent theme preference.",
      "reqIds": [
        "AR-12"
      ],
      "version": 1
    },
    {
      "id": "IF-48",
      "title": "Footer layering fixed and ICP footer logo asset updated (64x64)",
      "synonyms": [
        "Footer z-index fix",
        "AppFooter layering",
        "ICP logo replacement"
      ],
      "description": "Updates the inline ICP logo asset at /assets/generated/icp-logo.dim_64x64.png (kept at 64x64) and adjusts footer positioning/layering so the footer renders above/in front of the blurred bottom bar/menu.",
      "reqIds": [
        "AR-13"
      ],
      "version": 1
    },
    {
      "id": "IF-49",
      "title": "Calm site sound effects with global preferences and manager",
      "synonyms": [
        "SoundEffectsManager",
        "SoundContext",
        "useSound",
        "soundPreferences",
        "SFX"
      ],
      "description": "Adds optional, gentle UI sound effects (e.g., alerts/notifications, new feed, circle/join) managed by a global SoundContext + SoundEffectsManager, with centralized sound constants and persisted user preferences/utilities for enabling/disabling sounds.",
      "reqIds": [
        "AR-14"
      ],
      "version": 1
    },
    {
      "id": "IF-50",
      "title": "Profile picture (avatar) support with system avatars and editor UI",
      "synonyms": [
        "ProfileAvatarEditor",
        "system avatars",
        "profile avatar selection",
        "profileAvatar utils",
        "StorageClient"
      ],
      "description": "Adds avatar support to the profile flow, including a ProfileAvatarEditor UI and a set of bundled system avatar images users can choose from, with supporting utilities for avatar handling/storage integration.",
      "reqIds": [
        "AR-16"
      ],
      "version": 1
    },
    {
      "id": "IF-51",
      "title": "Reusable build template and deployment scaffolding (React + Motoko)",
      "synonyms": [
        "build-template",
        "deploy.sh",
        "icp.yaml",
        "Dockerfile",
        "image resize/prune scripts"
      ],
      "description": "Adds a standalone build-template workspace containing frontend/backend canister configs, deploy scripts, Dockerfile, and utility scripts (e.g., prune-unused-images, resize-images) to support reproducible builds and deployment/export of the CloseCircle stack.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-52",
      "title": "Compact in-app attribution line under CloseCircle logo; footer attribution block removed",
      "synonyms": [
        "AR-15 implementation",
        "AR-17 implementation",
        "header attribution",
        "remove footer powered-by ICP line"
      ],
      "description": "Removes the large footer attribution/credit block and relocates a shorter “Built by Abel Odoh …” attribution line under the CloseCircle logo within the in-app UI; drops the “Powered by Internet Computer” line per updated attribution requirements.",
      "reqIds": [
        "AR-15",
        "AR-17"
      ],
      "version": 1
    },
    {
      "id": "IF-53",
      "title": "Redesigned public homepage and new start/login entry routes",
      "synonyms": [
        "PublicHomePage",
        "HomeRoutePage",
        "StartAuthPage"
      ],
      "description": "Introduces a redesigned public landing experience and reorganizes unauthenticated entry routing with dedicated public pages to improve the first-run/login experience and separate public onboarding from the authenticated app shell.",
      "reqIds": [
        "AR-19"
      ],
      "version": 1
    },
    {
      "id": "IF-54",
      "title": "Invite-code-first homepage/login flow with session persistence",
      "synonyms": [
        "InviteCodeAuthStepPage",
        "inviteCodeSession"
      ],
      "description": "Implements an invite-code-first entry flow: users enter an invite/share code first, then proceed to authentication/account creation in a follow-up step. The entered code is persisted for the session to support the multi-step flow and downstream join behavior.",
      "reqIds": [
        "AR-20"
      ],
      "version": 1
    },
    {
      "id": "IF-55",
      "title": "Audience selector excludes self and removes recipient count in compose UI",
      "synonyms": [
        "audience.ts",
        "ComposeStatusPage audience UI",
        "no self recipient",
        "remove 'shared with X persons'"
      ],
      "description": "Updates the compose audience selector so the author is not shown as a tickable recipient while still always retaining author visibility of their own post; removes the UI copy that displays a 'shared with X persons' recipient count.",
      "reqIds": [
        "AR-18"
      ],
      "version": 1
    },
    {
      "id": "IF-56",
      "title": "Authenticated redirect gate to keep unauthenticated users off protected routes (logout-safe routing)",
      "synonyms": [
        "AuthenticatedRedirectGate",
        "logout redirect to public home",
        "protected-route redirect"
      ],
      "description": "Adds a routing gate that detects unauthenticated state and redirects the user away from authenticated-only routes to the public homepage/start flow, preventing protected-route error states and avoiding stray unauth overlays persisting after logout.",
      "reqIds": [
        "AR-23"
      ],
      "version": 1
    },
    {
      "id": "IF-57",
      "title": "Safe People selection principal conversion fix (avoid “invalid principal argument”)",
      "synonyms": [
        "AR-21 fix",
        "SafePeoplePanel principal handling",
        "Principal.fromText conversion"
      ],
      "description": "Fixes Safe People selection failures caused by passing non-Principal values by ensuring selected principals are normalized/converted to proper Principal values before canister calls.",
      "reqIds": [
        "AR-21"
      ],
      "version": 1
    },
    {
      "id": "IF-58",
      "title": "Join requests UI displays requester names when available (instead of raw principals)",
      "synonyms": [
        "AR-22 fix",
        "PendingRequestsPanel requester display name",
        "profile lookup for join requests"
      ],
      "description": "Updates the join-requests inbox UI to resolve and show requester profile display names where possible, falling back to principal only when a name cannot be resolved.",
      "reqIds": [
        "AR-22"
      ],
      "version": 1
    },
    {
      "id": "IF-59",
      "title": "Join-request notification requester name resolution fixed (avoid “Unknown user…”)",
      "synonyms": [
        "AR-24 fix",
        "notification generation/render name resolution",
        "join request notification copy"
      ],
      "description": "Fixes join-request notifications rendering as “Unknown user has requested to join your Circle.” by ensuring requester profile/name is correctly resolved during notification generation and/or rendering.",
      "reqIds": [
        "AR-24"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-new-authenticated-deep-link-only-route-and-page-that-lists-all-circle-owners-the-current-user-belongs-to-showing-only-each-owner-s-name-and-avatar-with-no-navigation-actions-when-an-entry-is-tapped-clicked",
      "title": "Add a new authenticated, deep-link-only route and page that lists all circle owners the current user belongs to, showing only each owner’s name and avatar, with no navigation/actions when an entry is tapped/clicked.",
      "reqIds": [
        "REQ-20"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-centralized-react-query-hook-to-fetch-the-caller-s-circles-i-m-in-owner-list-and-integrate-it-into-the-new-page-with-appropriate-caching-invalidation-behavior",
      "title": "Add a centralized React Query hook to fetch the caller’s “circles I’m in” owner list and integrate it into the new page with appropriate caching/invalidation behavior.",
      "reqIds": [
        "REQ-21"
      ],
      "version": 1
    },
    {
      "id": "feature-in-the-circle-tab-s-members-view-frontend-src-pages-circlepage-tsx-add-a-visible-navigation-link-directly-below-the-members-list-that-routes-to-the-existing-authenticated-page-at-authenticated-circles-im-in-circlesiminpage-the-link-text-must-be-exactly-view-people-who-have-me-in-their-circle",
      "title": "In the Circle tab’s Members view (frontend/src/pages/CirclePage.tsx), add a visible navigation link directly below the members list that routes to the existing authenticated page at /authenticated/circles-im-in (CirclesImInPage). The link text must be exactly: \"View people who have me in their circle\".",
      "reqIds": [
        "REQ-22"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-new-authenticated-deep-link-only-frontend-route-and-page-for-a-lightweight-private-closest-connections-viewer-that-displays-the-ranked-recommendations-and-shows-the-explanation-text-for-each-ranked-person-reasoning-visible-here-only",
      "title": "Add a new authenticated, deep-link-only frontend route and page for a lightweight private “Closest connections” viewer that displays the ranked recommendations and shows the explanation text for each ranked person (reasoning visible here only).",
      "reqIds": [
        "REQ-24"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-centralized-react-query-hook-to-fetch-the-caller-s-closest-connection-recommendations-from-the-backend-with-caching-and-invalidation-wired-to-existing-mutations-that-can-change-relationship-interaction-signals",
      "title": "Add a centralized React Query hook to fetch the caller’s closest-connection recommendations from the backend, with caching and invalidation wired to existing mutations that can change relationship/interaction signals.",
      "reqIds": [
        "REQ-25"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-existing-safe-people-selection-ui-to-show-smarter-recommendations-that-influence-what-the-user-sees-when-choosing-manually-max-2-without-automatically-setting-overwriting-safe-people-selections-and-without-showing-explanation-text-inside-the-safe-people-ui",
      "title": "Update the existing Safe People selection UI to show smarter recommendations that influence what the user sees when choosing manually (max 2), without automatically setting/overwriting Safe People selections and without showing explanation text inside the Safe People UI.",
      "reqIds": [
        "REQ-26"
      ],
      "version": 1
    },
    {
      "id": "feature-in-the-profile-page-s-analyzer-card-frontend-src-components-profile-moodanalyzercard-tsx-make-the-top-moods-section-permanently-collapsed-so-it-never-expands-i-e-the-list-bars-are-not-shown-even-if-the-user-clicks-taps-the-top-moods-disclosure-control",
      "title": "In the Profile page’s Analyzer card (frontend/src/components/profile/MoodAnalyzerCard.tsx), make the “Top Moods” section permanently collapsed so it never expands (i.e., the list/bars are not shown even if the user clicks/taps the “Top Moods” disclosure control).",
      "reqIds": [
        "REQ-27"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-profile-analyzer-card-frontend-src-components-profile-moodanalyzercard-tsx-so-the-top-moods-section-is-expanded-visible-when-data-exists-and-users-cannot-collapse-it",
      "title": "Update the Profile Analyzer card (frontend/src/components/profile/MoodAnalyzerCard.tsx) so the “Top Moods” section is expanded/visible when data exists, and users cannot collapse it.",
      "reqIds": [
        "REQ-28"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-sign-out-action-in-the-authenticated-header-so-that-after-a-successful-logout-it-always-redirects-the-user-to-the-public-root-route-homepage-regardless-of-the-current-page",
      "title": "Update the Sign Out action in the authenticated header so that after a successful logout it always redirects the user to the public root route \"/\" (homepage), regardless of the current page.",
      "reqIds": [
        "REQ-29"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-authenticated-only-routes-cannot-remain-visible-after-identity-is-cleared-when-the-app-is-currently-rendering-under-the-authenticated-layout-and-the-internet-identity-becomes-undefined-and-initialization-is-not-in-progress-immediately-redirect-to",
      "title": "Ensure authenticated-only routes cannot remain visible after identity is cleared: when the app is currently rendering under the authenticated layout and the Internet Identity becomes undefined (and initialization is not in progress), immediately redirect to \"/\".",
      "reqIds": [
        "REQ-30"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-2",
      "summary": "Replace blank/empty states across key surfaces with gentle starter prompts to guide users into action",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add supportive microcopy prompts in check-in/compose flow (e.g., “Want to leave one sentence?”, “No words is okay too.”)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Revise the app’s color system/theme with better color choices so color plays a stronger role across the entire dApp UI",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "Reduce on-screen text across the dApp for a more Gen Z-friendly, low-reading UI (shorter cues, progressive disclosure, more icon/visual communication)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Gen Z visual-first UI pass across the whole dApp: shorten long sentences, hide secondary info behind taps/chevrons, replace obvious labels with icons, and lean more on mood colors/visuals so text isn’t doing the work",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-25",
      "summary": "Update homepage CTA text from “No code? Create an account” to “No code? Create an account/Login”",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-26",
      "summary": "Allow users with no circle members to post a mood/status (e.g., self-only/default audience)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-28",
      "summary": "Implement a Snapscore-like cumulative engagement metric named “Pulse”: increases by the number of circle members selected when posting a mood status (e.g., +1 for 1 recipient, +5 for 5 recipients); no increase for self-only/private posts with no recipients and no increase for Silent Signals. Pulse should apply in all posting entry points (including daily check-in) and be visible to circle members somewhere in the app.",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-29",
      "summary": "Backend-enforce profile immutability: name, DOB, and gender cannot be changed after creation; only age-visibility, intent, preferred-gender, and share code remain editable. Also preserve original createdAt on any update (ignore client-supplied createdAt).",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-30",
      "summary": "Implement two-sided circle membership storage (backend-only first step): maintain synced owner→members and member→circles indexes on join/remove to enable future member-side lists and relationship features",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-31",
      "summary": "Add a mirrored member→circles index in the Motoko backend so circle membership is stored in a two-sided model: (1) the existing owner→members circle list, and (2) a new member→owners list that records which circle owners a principal belongs to.",
      "reqIds": [
        "REQ-12"
      ],
      "status": "pending"
    },
    {
      "id": "AR-32",
      "summary": "Keep the two circle indexes in sync on membership changes: when a join request is accepted, update both owner→members and member→circles; when a circle owner removes a member, remove the relationship from both indexes.",
      "reqIds": [
        "REQ-13"
      ],
      "status": "pending"
    },
    {
      "id": "AR-33",
      "summary": "Update backend authorization/relationship checks that currently require scanning every circle (e.g., circle connection checks and global connection derivation) to use the new member→circles index where applicable, while preserving the existing user-visible behavior.",
      "reqIds": [
        "REQ-14"
      ],
      "status": "pending"
    },
    {
      "id": "AR-34",
      "summary": "If the canister already has existing circle data stored under the one-sided model, add an upgrade-safe migration/backfill so the new member→circles index is populated from existing owner→members circle data on upgrade.",
      "reqIds": [
        "REQ-15"
      ],
      "status": "pending"
    },
    {
      "id": "AR-35",
      "summary": "Ensure circle membership is always kept in sync across both indexes on all membership-changing operations: (1) owner → members (the existing `circles` map) and (2) member → circle owners (the `memberCircles` map). Specifically: when a join request is accepted, add entries to both indexes; when a circle owner removes a member, remove entries from both indexes; and prevent duplicate entries in either index.",
      "reqIds": [
        "REQ-16"
      ],
      "status": "pending"
    },
    {
      "id": "AR-36",
      "summary": "Update backend relationship/authorization checks that currently scan all circles to use the `memberCircles` reverse index where applicable, while preserving the existing user-visible behavior. This includes at minimum `isCircleConnection(...)` and `getAllCircleConnections(...)` logic so that it no longer depends on iterating `circles.entries()` to discover who has the user in their circle.",
      "reqIds": [
        "REQ-17"
      ],
      "status": "pending"
    },
    {
      "id": "AR-37",
      "summary": "Add (or confirm) an upgrade-safe migration/backfill so that if the canister already has existing one-sided circle data (owner → members) at upgrade time, the `memberCircles` index is populated accordingly on upgrade, without changing the existing owner → members data.",
      "reqIds": [
        "REQ-18"
      ],
      "status": "pending"
    },
    {
      "id": "AR-38",
      "summary": "Add a deep-link-only, view-only screen listing all circle owners the user belongs to (member-side “circles I’m in”), showing name + avatar only",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-39",
      "summary": "Add a backend query method that returns the list of circle owners the caller belongs to (member-side reverse index), using the existing `memberCircles` storage.",
      "reqIds": [
        "REQ-19"
      ],
      "status": "pending"
    },
    {
      "id": "AR-40",
      "summary": "Add a visible link in the Circle tab (below the members list) to the deep-link-only page that lists “people who have me in their circle” (member-side owners list)",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-41",
      "summary": "Smarter Safe People suggestions: compute ranked recommendations (purely from existing relationship/interaction data like mutual circles and interaction frequency) to influence manual Safe People selection UI (max 2) without auto-setting or overwriting selections.",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-42",
      "summary": "Add a lightweight, private “Closest connections” viewer: show ranked people plus explanation of why they rank high (reasoning text shown here only), using existing relationship/interaction data; view-only with no automatic Safe People changes.",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-43",
      "summary": "Add a backend query API that returns ranked “closest connections” recommendations for the caller using only existing relationship/interaction data (e.g., mutual circle relationship signals and interaction frequency derived from existing posts/signals), and include per-person explanation strings describing why each person ranked highly.",
      "reqIds": [
        "REQ-23"
      ],
      "status": "pending"
    },
    {
      "id": "AR-45",
      "summary": "In Profile → Analyzer (MoodAnalyzerCard), make the “Top Moods” section expanded/visible (i.e., not collapsed), and prevent users from collapsing it",
      "reqIds": [
        "REQ-27"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "CloseCircle",
  "clarification_mode": "pro",
  "clarification_rounds": 0
}